{"lessons-3":{
"bad87fee1348bd9aec908849" : {"id":"bad87fee1348bd9aec908849","title":"Add Elements within Your Bootstrap Wells","videoUrl":"","content":"\nNow we're several <code>div</code> elements deep on each column of our row. This is as deep as we'll need to go. Now we can add our <code>button</code> elements.\nNest three <code>button</code> elements within each of your <code>well</code> <code>div</code> elements.\n"},
"bad87fee1348bd9aedc08845" : {"id":"bad87fee1348bd9aedc08845","title":"Add Font Awesome Icons to all of our Buttons","videoUrl":"","content":"\nFont Awesome is a convenient library of icons. These icons are vector graphics, stored in the <code>.svg</code> file format. These icons are treated just like fonts. You can specify their size using pixels, and they will assume the font size of their parent HTML elements.\nUse Font Awesome to add an <code>info-circle</code> icon to your info button and a <code>trash</code> icon to your delete button.\nNote: The <code>span</code> element is an acceptable alternative to the <code>i</code> element for the directions below.\n"},
"bad87fee1348bd9aedd08845" : {"id":"bad87fee1348bd9aedd08845","title":"Add Font Awesome Icons to our Buttons","videoUrl":"","content":"\nFont Awesome is a convenient library of icons. These icons are vector graphics, stored in the <code>.svg</code> file format. These icons are treated just like fonts. You can specify their size using pixels, and they will assume the font size of their parent HTML elements.\nYou can include Font Awesome in any app by adding the following code to the top of your HTML:\n<code>&#60;link rel=\"stylesheet\" href=\"https://maxcdn.bootstrapcdn.com/font-awesome/4.5.0/css/font-awesome.min.css\" integrity=\"sha384-XdYbMnZ/QjLh6iI4ogqCTaIjrFk87ip+ekIjefZch0Y+PvJ8CDYtEs1ipDmPorQ+\" crossorigin=\"anonymous\"&#62;</code>\nIn this case, we've already added it for you to this page behind the scenes.\nThe <code>i</code> element was originally used to make other elements italic, but is now commonly used for icons. You can add the Font Awesome classes to the <code>i</code> element to turn it into an icon, for example:\n<code>&lt;i class=\"fa fa-info-circle\"&gt;&lt;/i&gt;</code>\nNote that the <code>span</code> element is also acceptable for use with icons.\nUse Font Awesome to add a <code>thumbs-up</code> icon to your like button by giving it an <code>i</code> element with the classes <code>fa</code> and <code>fa-thumbs-up</code>; make sure to keep the text \"Like\" next to the icon.\n"},
"bad87fee1348bd9aec908853" : {"id":"bad87fee1348bd9aec908853","title":"Add id Attributes to Bootstrap Elements","videoUrl":"","content":"\nRecall that in addition to class attributes, you can give each of your elements an <code>id</code> attribute.\nEach id must be unique to a specific element and used only once per page.\nLet's give a unique id to each of our <code>div</code> elements of class <code>well</code>.\nRemember that you can give an element an id like this:\n<code>&#60;div class=\"well\" id=\"center-well\"&#62;</code>\nGive the well on the left the id of <code>left-well</code>. Give the well on the right the id of <code>right-well</code>.\n"},
"bad87fee1348bd9aec908850" : {"id":"bad87fee1348bd9aec908850","title":"Apply the Default Bootstrap Button Style","videoUrl":"","content":"\nBootstrap has another button class called <code>btn-default</code>.\nApply both the <code>btn</code> and <code>btn-default</code> classes to each of your <code>button</code> elements.\n"},
"bad87fee1348cd8acef08813" : {"id":"bad87fee1348cd8acef08813","title":"Call out Optional Actions with btn-info","videoUrl":"","content":"\nBootstrap comes with several pre-defined colors for buttons. The <code>btn-info</code> class is used to call attention to optional actions that the user can take.\nCreate a new block-level Bootstrap button below your \"Like\" button with the text \"Info\", and add Bootstrap's <code>btn-info</code> and <code>btn-block</code> classes to it.\nNote that these buttons still need the <code>btn</code> and <code>btn-block</code> classes.\n"},
"bad87fee1348bd8acde08812" : {"id":"bad87fee1348bd8acde08812","title":"Center Text with Bootstrap","videoUrl":"","content":"\nNow that we're using Bootstrap, we can center our heading element to make it look better. All we need to do is add the class <code>text-center</code> to our <code>h2</code> element.\nRemember that you can add several classes to the same element by separating each of them with a space, like this:\n<code>&#60h2 class=\"red-text text-center\"&#62your text&#60/h2&#62</code>\n"},
"bad87fee1348cd8acef08812" : {"id":"bad87fee1348cd8acef08812","title":"Create a Block Element Bootstrap Button","videoUrl":"","content":"\nNormally, your <code>button</code> elements with the <code>btn</code> and <code>btn-default</code> classes are only as wide as the text that they contain. For example:\n<code>&lt;button class=\"btn btn-default\"&gt;Submit&lt;/button&gt;</code>\nThis button would only be as wide as the word \"Submit\".\n<button class='btn btn-default'>Submit</button>\nBy making them block elements with the additional class of <code>btn-block</code>, your button will stretch to fill your page's entire horizontal space and any elements following it will flow onto a \"new line\" below the block.\n<code>&lt;button class=\"btn btn-default btn-block\"&gt;Submit&lt;/button&gt;</code>\nThis button would take up 100% of the available width.\n<button class='btn btn-default btn-block'>Submit</button>\nNote that these buttons still need the <code>btn</code> class.\nAdd Bootstrap's <code>btn-block</code> class to your Bootstrap button.\n"},
"bad87fee1348cd8acdf08812" : {"id":"bad87fee1348cd8acdf08812","title":"Create a Bootstrap Button","videoUrl":"","content":"\nBootstrap has its own styles for <code>button</code> elements, which look much better than the plain HTML ones.\nCreate a new <code>button</code> element below your large kitten photo. Give it the <code>btn</code> and <code>btn-default</code> classes, as well as the text of \"Like\".\n"},
"bad87fee1348bd9aec908846" : {"id":"bad87fee1348bd9aec908846","title":"Create a Bootstrap Headline","videoUrl":"","content":"\nNow let's build something from scratch to practice our HTML, CSS and Bootstrap skills.\nWe'll build a jQuery playground, which we'll soon put to use in our jQuery challenges.\nTo start with, create an <code>h3</code> element, with the text <code>jQuery Playground</code>.\nColor your <code>h3</code> element with the <code>text-primary</code> Bootstrap class, and center it with the <code>text-center</code> Bootstrap class.\n"},
"bad87fee1348bd9bec908846" : {"id":"bad87fee1348bd9bec908846","title":"Create a Bootstrap Row","videoUrl":"","content":"\nNow we'll create a Bootstrap row for our inline elements.\nCreate a <code>div</code> element below the <code>h3</code> tag, with a class of <code>row</code>.\n"},
"bad87fee1348bd9aec908852" : {"id":"bad87fee1348bd9aec908852","title":"Create a Class to Target with jQuery Selectors","videoUrl":"","content":"\nNot every class needs to have corresponding CSS. Sometimes we create classes just for the purpose of selecting these elements more easily using jQuery.\nGive each of your <code>button</code> elements the class <code>target</code>.\n"},
"bad87fee1348bd9aede08845" : {"id":"bad87fee1348bd9aede08845","title":"Create a Custom Heading","videoUrl":"","content":"\nWe will make a simple heading for our Cat Photo App by putting the title and relaxing cat image in the same row.\nRemember, Bootstrap uses a responsive grid system, which makes it easy to put elements into rows and specify each element's relative width. Most of Bootstrap's classes can be applied to a <code>div</code> element.\nNest your first image and your <code>h2</code> element within a single <code>&#60;div class=\"row\"&#62;</code> element. Nest your <code>h2</code> element within a <code>&#60;div class=\"col-xs-8\"&#62;</code> and your image in a <code>&#60;div class=\"col-xs-4\"&#62;</code> so that they are on the same line.\nNotice how the image is now just the right size to fit along the text?\n"},
"bad87fee1348bd9aec908848" : {"id":"bad87fee1348bd9aec908848","title":"Create Bootstrap Wells","videoUrl":"","content":"\nBootstrap has a class called <code>well</code> that can create a visual sense of depth for your columns.\nNest one <code>div</code> element with the class <code>well</code> within each of your <code>col-xs-6</code> <code>div</code> elements.\n"},
"bad87fee1347bd9aedf08845" : {"id":"bad87fee1347bd9aedf08845","title":"Ditch Custom CSS for Bootstrap","videoUrl":"","content":"\nWe can clean up our code and make our Cat Photo App look more conventional by using Bootstrap's built-in styles instead of the custom styles we created earlier.\nDon't worry - there will be plenty of time to customize our CSS later.\nDelete the <code>.red-text</code>, <code>p</code>, and <code>.smaller-image</code> CSS declarations from your <code>style</code> element so that the only declarations left in your <code>style</code> element are <code>h2</code> and <code>thick-green-border</code>.\nThen delete the <code>p</code> element that contains a dead link. Then remove the <code>red-text</code> class from your <code>h2</code> element and replace it with the <code>text-primary</code> Bootstrap class.\nFinally, remove the \"smaller-image\" class from your first <code>img</code> element and replace it with the <code>img-responsive</code> class.\n"},
"bad87fee1348bd9aec908855" : {"id":"bad87fee1348bd9aec908855","title":"Give Each Element a Unique id","videoUrl":"","content":"\nWe will also want to be able to use jQuery to target each button by its unique id.\nGive each of your buttons a unique id, starting with <code>target1</code> and ending with <code>target6</code>.\nMake sure that <code>target1</code> to <code>target3</code> are in <code>#left-well</code>, and <code>target4</code> to <code>target6</code> are in <code>#right-well</code>.\n"},
"bad87fee1348bd9aec908746" : {"id":"bad87fee1348bd9aec908746","title":"House our page within a Bootstrap container-fluid div","videoUrl":"","content":"\nNow let's make sure all the content on your page is mobile-responsive.\nLet's nest your <code>h3</code> element within a <code>div</code> element with the class <code>container-fluid</code>.\n"},
"bad87fee1348bd9aec908856" : {"id":"bad87fee1348bd9aec908856","title":"Label Bootstrap Buttons","videoUrl":"","content":"\nJust like we labeled our wells, we want to label our buttons.\nGive each of your <code>button</code> elements text that corresponds to its <code>id</code>'s selector.\n"},
"bad87fee1348bd9aec908854" : {"id":"bad87fee1348bd9aec908854","title":"Label Bootstrap Wells","videoUrl":"","content":"\nFor the sake of clarity, let's label both of our wells with their ids.\nAbove your left-well, inside its <code>col-xs-6</code> <code>div</code> element, add a <code>h4</code> element with the text <code>#left-well</code>.\nAbove your right-well, inside its <code>col-xs-6</code> <code>div</code> element, add a <code>h4</code> element with the text <code>#right-well</code>.\n"},
"bad87fee1348bd9aec908845" : {"id":"bad87fee1348bd9aec908845","title":"Line up Form Elements Responsively with Bootstrap","videoUrl":"","content":"\nNow let's get your form <code>input</code> and your submission <code>button</code> on the same line. We'll do this the same way we have previously: by using a <code>div</code> element with the class <code>row</code>, and other <code>div</code> elements within it using the <code>col-xs-*</code> class.\nNest both your form's text <code>input</code> and submit <code>button</code> within a <code>div</code> with the class <code>row</code>. Nest your form's text <code>input</code> within a div with the class of <code>col-xs-7</code>. Nest your form's submit <code>button</code> in a <code>div</code> with the class <code>col-xs-5</code>.\nThis is the last challenge we'll do for our Cat Photo App for now. We hope you've enjoyed learning Font Awesome, Bootstrap, and responsive design!\n"},
"bad87fee1348bd9acde08812" : {"id":"bad87fee1348bd9acde08812","title":"Make Images Mobile Responsive","videoUrl":"","content":"\nFirst, add a new image below the existing one. Set its <code>src</code> attribute to <code>https://bit.ly/fcc-running-cats</code>.\nIt would be great if this image could be exactly the width of our phone's screen.\nFortunately, with Bootstrap, all we need to do is add the <code>img-responsive</code> class to your image. Do this, and the image should perfectly fit the width of your page.\n"},
"bad87fee1348bd9aeda08845" : {"id":"bad87fee1348bd9aeda08845","title":"Responsively Style Checkboxes","videoUrl":"","content":"\nYou can use Bootstrap's <code>col-xs-*</code> classes on <code>form</code> elements, too! This way, our checkboxes will be evenly spread out across the page, regardless of how wide the screen resolution is.\nNest all three of your checkboxes in a <code>&#60;div class=\"row\"&#62;</code> element. Then nest each of them in a <code>&#60;div class=\"col-xs-4\"&#62;</code> element.\n"},
"bad87fee1348bd9aedb08845" : {"id":"bad87fee1348bd9aedb08845","title":"Responsively Style Radio Buttons","videoUrl":"","content":"\nYou can use Bootstrap's <code>col-xs-*</code> classes on <code>form</code> elements, too! This way, our radio buttons will be evenly spread out across the page, regardless of how wide the screen resolution is.\nNest both your radio buttons within a <code>&#60;div class=\"row\"&#62;</code> element. Then nest each of them within a <code>&#60;div class=\"col-xs-6\"&#62;</code> element.\n<strong>Note:</strong> As a reminder, radio buttons are <code>input</code> elements of type <code>radio</code>.\n"},
"bad87fee1348bd9aec908847" : {"id":"bad87fee1348bd9aec908847","title":"Split Your Bootstrap Row","videoUrl":"","content":"\nNow that we have a Bootstrap Row, let's split it into two columns to house our elements.\nCreate two <code>div</code> elements within your row, both with the class <code>col-xs-6</code>.\n"},
"bad87fee1348bd9aed908845" : {"id":"bad87fee1348bd9aed908845","title":"Style Text Inputs as Form Controls","videoUrl":"","content":"\nYou can add the <code>fa-paper-plane</code> Font Awesome icon by adding <code>&#60;i class=\"fa fa-paper-plane\"&#62;&#60;/i&#62;</code> within your submit <code>button</code> element.\nGive your form's text input field a class of <code>form-control</code>. Give your form's submit button the classes <code>btn btn-primary</code>. Also give this button the Font Awesome icon of <code>fa-paper-plane</code>.\nAll textual <code>&lt;input&gt;</code>, <code>&lt;textarea&gt;</code>, and <code>&lt;select&gt;</code> elements with the class <code>.form-control</code> have a width of 100%.\n"},
"bad87fee1348cd8acef08811" : {"id":"bad87fee1348cd8acef08811","title":"Taste the Bootstrap Button Color Rainbow","videoUrl":"","content":"\nThe <code>btn-primary</code> class is the main color you'll use in your app. It is useful for highlighting actions you want your user to take.\nReplace Bootstrap's <code>btn-default</code> class by <code>btn-primary</code> in your button.\nNote that this button will still need the <code>btn</code> and <code>btn-block</code> classes.\n"},
"bad87fee1348bd9aedf08845" : {"id":"bad87fee1348bd9aedf08845","title":"Use a span to Target Inline Elements","videoUrl":"","content":"\nYou can use spans to create inline elements. Remember when we used the <code>btn-block</code> class to make the button fill the entire row?\n<button class='btn' style='background-color: rgb(0, 100, 0);  color: rgb(255, 255, 255);'>normal button</button>\n<button class='btn btn-block' style='background-color: rgb(0, 100, 0);  color: rgb(255, 255, 255);'>btn-block button</button>\nThat illustrates the difference between an \"inline\" element and a \"block\" element.\nBy using the inline <code>span</code> element, you can put several elements on the same line, and even style different parts of the same line differently.\nNest the word \"love\" in your \"Things cats love\" element below within a <code>span</code> element. Then give that <code>span</code> the class <code>text-danger</code> to make the text red.\nHere's how you would do this with the \"Top 3 things cats hate\" element:\n<code>&#60;p&#62;Top 3 things cats &#60;span class=\"text-danger\"&#62;hate:&#60;/span&#62;&#60;/p&#62;</code>\n"},
"bad87fee1348bd9aec908857" : {"id":"bad87fee1348bd9aec908857","title":"Use Comments to Clarify Code","videoUrl":"","content":"\nWhen we start using jQuery, we will modify HTML elements without needing to actually change them in HTML.\nLet's make sure that everyone knows they shouldn't actually modify any of this code directly.\nRemember that you can start a comment with <code>&#60;!--</code> and end a comment with <code>--&#62;</code>\nAdd a comment at the top of your HTML that says <code>Only change code above this line.</code>\n"},
"bad87fee1348bd9acde08712" : {"id":"bad87fee1348bd9acde08712","title":"Use Responsive Design with Bootstrap Fluid Containers","videoUrl":"","content":"\nIn the HTML5 and CSS section of freeCodeCamp we built a Cat Photo App. Now let's go back to it. This time, we'll style it using the popular Bootstrap responsive CSS framework.\nBootstrap will figure out how wide your screen is and respond by resizing your HTML elements - hence the name <code>Responsive Design</code>.\nWith responsive design, there is no need to design a mobile version of your website. It will look good on devices with screens of any width.\nYou can add Bootstrap to any app by adding the following code to the top of your HTML:\n<code>&#60;link rel=\"stylesheet\" href=\"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css\" integrity=\"sha384-BVYiiSIFeK1dGmJRAkycuHAHRg32OmUcww7on3RYdg4Va+PmSTsz/K68vbdEjh4u\" crossorigin=\"anonymous\"/&#62;</code>\nIn this case, we've already added it for you to this page behind the scenes. Note that using either <code>></code> or <code>/></code> to close the <code>link</code> tag is acceptable.\nTo get started, we should nest all of our HTML (except the <code>link</code> tag and the <code>style</code> element) in a <code>div</code> element with the class <code>container-fluid</code>.\n"},
"bad88fee1348ce8acef08815" : {"id":"bad88fee1348ce8acef08815","title":"Use the Bootstrap Grid to Put Elements Side By Side","videoUrl":"","content":"\nBootstrap uses a responsive 12-column grid system, which makes it easy to put elements into rows and specify each element's relative width. Most of Bootstrap's classes can be applied to a <code>div</code> element.\nBootstrap has different column width attributes that it uses depending on how wide the user's screen is. For example, phones have narrow screens, and laptops have wider screens.\nTake for example Bootstrap's <code>col-md-*</code> class. Here, <code>md</code> means medium, and <code>*</code> is a number specifying how many columns wide the element should be. In this case, the column width of an element on a medium-sized screen, such as a laptop, is being specified.\nIn the Cat Photo App that we're building, we'll use <code>col-xs-*</code>, where <code>xs</code> means extra small (like an extra-small mobile phone screen), and <code>*</code> is the number of columns specifying how many columns wide the element should be.\nPut the <code>Like</code>, <code>Info</code> and <code>Delete</code> buttons side-by-side by nesting all three of them within one <code>&#60;div class=\"row\"&#62;</code> element, then each of them within a <code>&#60;div class=\"col-xs-4\"&#62;</code> element.\nThe <code>row</code> class is applied to a <code>div</code>, and the buttons themselves can be nested within it.\n"},
"bad87fee1348ce8acef08814" : {"id":"bad87fee1348ce8acef08814","title":"Warn Your Users of a Dangerous Action with btn-danger","videoUrl":"","content":"\nBootstrap comes with several pre-defined colors for buttons. The <code>btn-danger</code> class is the button color you'll use to notify users that the button performs a destructive action, such as deleting a cat photo.\nCreate a button with the text \"Delete\" and give it the class <code>btn-danger</code>.\nNote that these buttons still need the <code>btn</code> and <code>btn-block</code> classes.\n"},
"587d7dbc367417b2b2512bae" : {"id":"587d7dbc367417b2b2512bae","title":"Build a Drum Machine","videoUrl":"","content":"\n<strong>Objective:</strong> Build a <a href='https://codepen.io' target='_blank'>CodePen.io</a> app that is functionally similar to this: <a href='https://codepen.io/freeCodeCamp/full/MJyNMd' target='_blank'>https://codepen.io/freeCodeCamp/full/MJyNMd</a>.\nFulfill the below <a href='https://en.wikipedia.org/wiki/User_story' target='_blank'>user stories</a> and get all of the tests to pass. Give it your own personal style.\nYou can use any mix of HTML, JavaScript, CSS, Bootstrap, SASS, React, Redux, and jQuery to complete this project. You should use a frontend framework (like React for example) because this section is about learning frontend frameworks. Additional technologies not listed above are not recommended and using them is at your own risk. We are looking at supporting other frontend frameworks like Angular and Vue, but they are not currently supported. We will accept and try to fix all issue reports that use the suggested technology stack for this project. Happy coding!\n<strong>User Story #1:</strong> I should be able to see an outer container with a corresponding <code>id=\"drum-machine\"</code> that contains all other elements.\n<strong>User Story #2:</strong> Within <code>#drum-machine</code> I can see an element with a corresponding <code>id=\"display\"</code>.\n<strong>User Story #3:</strong> Within <code>#drum-machine</code> I can see 9 clickable drum pad elements, each with a class name of <code>drum-pad</code>, a unique id that describes the audio clip the drum pad will be set up to trigger, and an inner text that corresponds to one of the following keys on the keyboard: Q, W, E, A, S, D, Z, X, C. The drum pads MUST be in this order.\n<strong>User Story #4:</strong> Within each <code>.drum-pad</code>, there should be an HTML5 <code>audio</code> element which has a <code>src</code> attribute pointing to an audio clip, a class name of <code>clip</code>, and an id corresponding to the inner text of its parent <code>.drum-pad</code> (e.g. <code>id=\"Q\"</code>, <code>id=\"W\"</code>, <code>id=\"E\"</code> etc.).\n<strong>User Story #5:</strong> When I click on a <code>.drum-pad</code> element, the audio clip contained in its child <code>audio</code> element should be triggered.\n<strong>User Story #6:</strong> When I press the trigger key associated with each <code>.drum-pad</code>, the audio clip contained in its child <code>audio</code> element should be triggered (e.g. pressing the Q key should trigger the drum pad which contains the string \"Q\", pressing the W key should trigger the drum pad which contains the string \"W\", etc.).\n<strong>User Story #7:</strong> When a <code>.drum-pad</code> is triggered, a string describing the associated audio clip is displayed as the inner text of the <code>#display</code> element (each string must be unique).\nYou can build your project by forking <a href='http://codepen.io/freeCodeCamp/pen/MJjpwO' target='_blank'>this CodePen pen</a>. Or you can use this CDN link to run the tests in any environment you like: <code>https://cdn.freecodecamp.org/testable-projects-fcc/v1/bundle.js</code>\nOnce you're done, submit the URL to your working project with all its tests passing.\nRemember to use the <a href='https://forum.freecodecamp.org/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> method if you get stuck.\n"},
"bd7158d8c442eddfaeb5bd17" : {"id":"bd7158d8c442eddfaeb5bd17","title":"Build a JavaScript Calculator","videoUrl":"","content":"\n<strong>Objective:</strong> Build a <a href='https://codepen.io' target='_blank'>CodePen.io</a> app that is functionally similar to this: <a href='https://codepen.io/freeCodeCamp/full/wgGVVX' target='_blank'>https://codepen.io/freeCodeCamp/full/wgGVVX</a>.\nFulfill the below <a href='https://en.wikipedia.org/wiki/User_story' target='_blank'>user stories</a> and get all of the tests to pass. Give it your own personal style.\nYou can use any mix of HTML, JavaScript, CSS, Bootstrap, SASS, React, Redux, and jQuery to complete this project. You should use a frontend framework (like React for example) because this section is about learning frontend frameworks. Additional technologies not listed above are not recommended and using them is at your own risk. We are looking at supporting other frontend frameworks like Angular and Vue, but they are not currently supported. We will accept and try to fix all issue reports that use the suggested technology stack for this project. Happy coding!\n<strong>User Story #1:</strong> My calculator should contain a clickable element containing an <code>=</code> (equal sign) with a corresponding <code>id=\"equals\"</code>.\n<strong>User Story #2:</strong> My calculator should contain 10 clickable elements containing one number each from 0-9, with the following corresponding IDs: <code>id=\"zero\"</code>, <code>id=\"one\"</code>, <code>id=\"two\"</code>, <code>id=\"three\"</code>, <code>id=\"four\"</code>, <code>id=\"five\"</code>, <code>id=\"six\"</code>, <code>id=\"seven\"</code>, <code>id=\"eight\"</code>, and <code>id=\"nine\"</code>.\n<strong>User Story #3:</strong> My calculator should contain 4 clickable elements each containing one of the 4 primary mathematical operators with the following corresponding IDs: <code>id=\"add\"</code>, <code>id=\"subtract\"</code>, <code>id=\"multiply\"</code>, <code>id=\"divide\"</code>.\n<strong>User Story #4:</strong> My calculator should contain a clickable element containing a <code>.</code> (decimal point) symbol with a corresponding <code>id=\"decimal\"</code>.\n<strong>User Story #5:</strong> My calculator should contain a clickable element with an <code>id=\"clear\"</code>.\n<strong>User Story #6:</strong> My calculator should contain an element to display values with a corresponding <code>id=\"display\"</code>.\n<strong>User Story #7:</strong> At any time, pressing the clear button clears the input and output values, and returns the calculator to its initialized state; 0 should be shown in the element with the id of <code>display</code>.\n<strong>User Story #8:</strong> As I input numbers, I should be able to see my input in the element with the id of <code>display</code>.\n<strong>User Story #9:</strong> In any order, I should be able to add, subtract, multiply and divide a chain of numbers of any length, and when I hit <code>=</code>, the correct result should be shown in the element with the id of <code>display</code>.\n<strong>User Story #10:</strong> When inputting numbers, my calculator should not allow a number to begin with multiple zeros.\n<strong>User Story #11:</strong> When the decimal element is clicked, a <code>.</code> should append to the currently displayed value; two <code>.</code> in one number should not be accepted.\n<strong>User Story #12:</strong> I should be able to perform any operation (+, -, *, /) on numbers containing decimal points.\n<strong>User Story #13:</strong> If 2 or more operators are entered consecutively, the operation performed should be the last operator entered.\n<strong>User Story #14:</strong> Pressing an operator immediately following <code>=</code> should start a new calculation that operates on the result of the previous evaluation.\n<strong>User Story #15:</strong> My calculator should have several decimal places of precision when it comes to rounding (note that there is no exact standard, but you should be able to handle calculations like <code>2 / 7</code> with reasonable precision to at least 4 decimal places).\n<strong>Note On Calculator Logic:</strong> It should be noted that there are two main schools of thought on calculator input logic: <dfn>immediate execution logic</dfn> and <dfn>formula logic</dfn>. Our example utilizes formula logic and observes order of operation precedence, immediate execution does not. Either is acceptable, but please note that depending on which you choose, your calculator may yield different results than ours for certain equations (see below example). As long as your math can be verified by another production calculator, please do not consider this a bug.\n<strong>EXAMPLE:</strong> <code>3 + 5 x 6 - 2 / 4 =</code><br><ul><li><strong>Immediate Execution Logic:</strong> <code>11.5</code></li><li><strong>Formula/Expression Logic:</strong> <code>32.5</code></li></ul>\nYou can build your project by forking <a href='http://codepen.io/freeCodeCamp/pen/MJjpwO' target='_blank'>this CodePen pen</a>. Or you can use this CDN link to run the tests in any environment you like: <code>https://cdn.freecodecamp.org/testable-projects-fcc/v1/bundle.js</code>\nOnce you're done, submit the URL to your working project with all its tests passing.\nRemember to use the <a href='https://forum.freecodecamp.org/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> method if you get stuck.\n"},
"bd7157d8c242eddfaeb5bd13" : {"id":"bd7157d8c242eddfaeb5bd13","title":"Build a Markdown Previewer","videoUrl":"","content":"\n<strong>Objective:</strong> Build a <a href='https://codepen.io' target='_blank'>CodePen.io</a> app that is functionally similar to this: <a href='https://codepen.io/freeCodeCamp/full/GrZVVO' target='_blank'>https://codepen.io/freeCodeCamp/full/GrZVVO</a>.\nFulfill the below <a href='https://en.wikipedia.org/wiki/User_story' target='_blank'>user stories</a> and get all of the tests to pass. Give it your own personal style.\nYou can use any mix of HTML, JavaScript, CSS, Bootstrap, SASS, React, Redux, and jQuery to complete this project. You should use a frontend framework (like React for example) because this section is about learning frontend frameworks. Additional technologies not listed above are not recommended and using them is at your own risk. We are looking at supporting other frontend frameworks like Angular and Vue, but they are not currently supported. We will accept and try to fix all issue reports that use the suggested technology stack for this project. Happy coding!\n<strong>User Story #1:</strong> I can see a <code>textarea</code> element with a corresponding <code>id=\"editor\"</code>.\n<strong>User Story #2:</strong> I can see an element with a corresponding <code>id=\"preview\"</code>.\n<strong>User Story #3:</strong> When I enter text into the <code>#editor</code> element, the <code>#preview</code> element is updated as I type to display the content of the textarea.\n<strong>User Story #4:</strong> When I enter GitHub flavored markdown into the <code>#editor</code> element, the text is rendered as HTML in the <code>#preview</code> element as I type (HINT: You don't need to parse Markdown yourself - you can import the Marked library for this: <a href='https://cdnjs.com/libraries/marked' target='_blank'>https://cdnjs.com/libraries/marked</a>).\n<strong>User Story #5:</strong> When my markdown previewer first loads, the default text in the <code>#editor</code> field should contain valid markdown that represents at least one of each of the following elements: a header (H1 size), a sub header (H2 size), a link, inline code, a code block, a list item, a blockquote, an image, and bolded text.\n<strong>User Story #6:</strong> When my markdown previewer first loads, the default markdown in the <code>#editor</code> field should be rendered as HTML in the <code>#preview</code> element.\n<strong>Optional Bonus (you do not need to make this test pass):</strong> My markdown previewer interprets carriage returns and renders them as <code>br</code> (line break) elements.\nYou can build your project by forking <a href='http://codepen.io/freeCodeCamp/pen/MJjpwO' target='_blank'>this CodePen pen</a>. Or you can use this CDN link to run the tests in any environment you like: <code>https://cdn.freecodecamp.org/testable-projects-fcc/v1/bundle.js</code>\nOnce you're done, submit the URL to your working project with all its tests passing.\nRemember to use the <a href='https://forum.freecodecamp.org/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> method if you get stuck.\n"},
"bd7158d8c442eddfaeb5bd0f" : {"id":"bd7158d8c442eddfaeb5bd0f","title":"Build a Pomodoro Clock","videoUrl":"","content":"\n<strong>Objective:</strong> Build a <a href='https://codepen.io' target='_blank'>CodePen.io</a> app that is functionally similar to this: <a href='https://codepen.io/freeCodeCamp/full/XpKrrW' target='_blank'>https://codepen.io/freeCodeCamp/full/XpKrrW</a>.\nFulfill the below <a href='https://en.wikipedia.org/wiki/User_story' target='_blank'>user stories</a> and get all of the tests to pass. Give it your own personal style.\nYou can use any mix of HTML, JavaScript, CSS, Bootstrap, SASS, React, Redux, and jQuery to complete this project. You should use a frontend framework (like React for example) because this section is about learning frontend frameworks. Additional technologies not listed above are not recommended and using them is at your own risk. We are looking at supporting other frontend frameworks like Angular and Vue, but they are not currently supported. We will accept and try to fix all issue reports that use the suggested technology stack for this project. Happy coding!\n<strong>User Story #1:</strong> I can see an element with <code>id=\"break-label\"</code> that contains a string (e.g. \"Break Length\").\n<strong>User Story #2:</strong> I can see an element with <code>id=\"session-label\"</code> that contains a string (e.g. \"Session Length\").\n<strong>User Story #3:</strong> I can see two clickable elements with corresponding IDs: <code>id=\"break-decrement\"</code> and <code>id=\"session-decrement\"</code>.\n<strong>User Story #4:</strong> I can see two clickable elements with corresponding IDs: <code>id=\"break-increment\"</code> and <code>id=\"session-increment\"</code>.\n<strong>User Story #5:</strong> I can see an element with a corresponding <code>id=\"break-length\"</code>, which by default (on load) displays a value of 5.\n<strong>User Story #6:</strong> I can see an element with a corresponding <code>id=\"session-length\"</code>, which by default displays a value of 25.\n<strong>User Story #7:</strong> I can see an element with a corresponding <code>id=\"timer-label\"</code>, that contains a string indicating a session is initialized (e.g. \"Session\").\n<strong>User Story #8:</strong> I can see an element with corresponding <code>id=\"time-left\"</code>. NOTE: Paused or running, the value in this field should always be displayed in <code>mm:ss</code> format (i.e. 25:00).\n<strong>User Story #9:</strong> I can see a clickable element with a corresponding <code>id=\"start_stop\"</code>.\n<strong>User Story #10:</strong> I can see a clickable element with a corresponding <code>id=\"reset\"</code>.\n<strong>User Story #11:</strong> When I click the element with the id of <code>reset</code>, any running timer should be stopped, the value within <code>id=\"break-length\"</code> should return to <code>5</code>, the value within <code>id=\"session-length\"</code> should return to 25, and the element with <code>id=\"time-left\"</code> should reset to it's default state.\n<strong>User Story #12:</strong> When I click the element with the id of <code>break-decrement</code>, the value within <code>id=\"break-length\"</code> decrements by a value of 1, and I can see the updated value.\n<strong>User Story #13:</strong> When I click the element with the id of <code>break-increment</code>, the value within <code>id=\"break-length\"</code> increments by a value of 1, and I can see the updated value.\n<strong>User Story #14:</strong> When I click the element with the id of <code>session-decrement</code>, the value within <code>id=\"session-length\"</code> decrements by a value of 1, and I can see the updated value.\n<strong>User Story #15:</strong> When I click the element with the id of <code>session-increment</code>, the value within <code>id=\"session-length\"</code> increments by a value of 1, and I can see the updated value.\n<strong>User Story #16:</strong> I should not be able to set a session or break length to <= 0.\n<strong>User Story #17:</strong> I should not be able to set a session or break length to > 60.\n<strong>User Story #18:</strong> When I first click the element with <code>id=\"start_stop\"</code>, the timer should begin running from the value currently displayed in <code>id=\"session-length\"</code>, even if the value has been incremented or decremented from the original value of 25.\n<strong>User Story #19:</strong> If the timer is running, the element with the id of <code>time-left</code> should display the remaining time in <code>mm:ss</code> format (decrementing by a value of 1 and updating the display every 1000ms).\n<strong>User Story #20:</strong> If the timer is running and I click the element with <code>id=\"start_stop\"</code>, the countdown should pause.\n<strong>User Story #21:</strong> If the timer is paused and I click the element with <code>id=\"start_stop\"</code>, the countdown should resume running from the point at which it was paused.\n<strong>User Story #22:</strong> When a session countdown reaches zero (NOTE: timer MUST reach 00:00), and a new countdown begins, the element with the id of <code>timer-label</code> should display a string indicating a break has begun.\n<strong>User Story #23:</strong> When a session countdown reaches zero (NOTE: timer MUST reach 00:00), a new break countdown should begin, counting down from the value currently displayed in the <code>id=\"break-length\"</code> element.\n<strong>User Story #24:</strong> When a break countdown reaches zero (NOTE: timer MUST reach 00:00), and a new countdown begins, the element with the id of <code>timer-label</code> should display a string indicating a session has begun.\n<strong>User Story #25:</strong> When a break countdown reaches zero (NOTE: timer MUST reach 00:00), a new session countdown should begin, counting down from the value currently displayed in the <code>id=\"session-length\"</code> element.\n<strong>User Story #26:</strong> When a countdown reaches zero (NOTE: timer MUST reach 00:00), a sound indicating that time is up should play. This should utilize an HTML5 <code>audio</code> tag and have a corresponding <code>id=\"beep\"</code>.\n<strong>User Story #27:</strong> The audio element with <code>id=\"beep\"</code> must be 1 second or longer.\n<strong>User Story #28:</strong> The audio element with id of <code>beep</code> must stop playing and be rewound to the beginning when the element with the id of <code>reset</code> is clicked.\nYou can build your project by forking <a href='http://codepen.io/freeCodeCamp/pen/MJjpwO' target='_blank'>this CodePen pen</a>. Or you can use this CDN link to run the tests in any environment you like: <code>https://cdn.freecodecamp.org/testable-projects-fcc/v1/bundle.js</code>\nOnce you're done, submit the URL to your working project with all its tests passing.\nRemember to use the <a href='https://forum.freecodecamp.org/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> method if you get stuck.\n"},
"bd7158d8c442eddfaeb5bd13" : {"id":"bd7158d8c442eddfaeb5bd13","title":"Build a Random Quote Machine","videoUrl":"","content":"\n<strong>Objective:</strong> Build a <a href='https://codepen.io' target='_blank'>CodePen.io</a> app that is functionally similar to this: <a href='https://codepen.io/freeCodeCamp/full/qRZeGZ' target='_blank'>https://codepen.io/freeCodeCamp/full/qRZeGZ</a>.\nFulfill the below <a href='https://en.wikipedia.org/wiki/User_story' target='_blank'>user stories</a> and get all of the tests to pass. Give it your own personal style.\nYou can use any mix of HTML, JavaScript, CSS, Bootstrap, SASS, React, Redux, and jQuery to complete this project. You should use a frontend framework (like React for example) because this section is about learning frontend frameworks. Additional technologies not listed above are not recommended and using them is at your own risk. We are looking at supporting other frontend frameworks like Angular and Vue, but they are not currently supported. We will accept and try to fix all issue reports that use the suggested technology stack for this project. Happy coding!\n<strong>User Story #1:</strong> I can see a wrapper element with a corresponding <code>id=\"quote-box\"</code>.\n<strong>User Story #2:</strong> Within <code>#quote-box</code>, I can see an element with a corresponding <code>id=\"text\"</code>.\n<strong>User Story #3:</strong> Within <code>#quote-box</code>, I can see an element with a corresponding <code>id=\"author\"</code>.\n<strong>User Story #4:</strong> Within <code>#quote-box</code>, I can see a clickable element with a corresponding <code>id=\"new-quote\"</code>.\n<strong>User Story #5:</strong> Within <code>#quote-box</code>, I can see a clickable <codea</code> element with a corresponding <code>id=\"tweet-quote\"</code>.\n<strong>User Story #6:</strong> On first load, my quote machine displays a random quote in the element with <code>id=\"text\"</code>.\n<strong>User Story #7:</strong> On first load, my quote machine displays the random quote's author in the element with <code>id=\"author\"</code>.\n<strong>User Story #8:</strong> When the <code>#new-quote</code> button is clicked, my quote machine should fetch a new quote and display it in the <code>#text</code> element.\n<strong>User Story #9:</strong> My quote machine should fetch the new quote's author when the <code>#new-quote</code> button is clicked and display it in the <code>#author</code> element.\n<strong>User Story #10:</strong> I can tweet the current quote by clicking on the <code>#tweet-quote</code> <code>a</code> element. This <code>a</code> element should include the <code>\"twitter.com/intent/tweet\"</code> path in it's <code>href</code> attribute to tweet the current quote.\n<strong>User Story #11:</strong> The <code>#quote-box</code> wrapper element should be horizontally centered. Please run tests with browser's zoom level at 100% and page maximized.\nYou can build your project by forking <a href='http://codepen.io/freeCodeCamp/pen/MJjpwO' target='_blank'>this CodePen pen</a>. Or you can use this CDN link to run the tests in any environment you like: <code>https://cdn.freecodecamp.org/testable-projects-fcc/v1/bundle.js</code>\nOnce you're done, submit the URL to your working project with all its tests passing.\nRemember to use the <a href='https://forum.freecodecamp.org/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> method if you get stuck.\n"},
"564944c91be2204b269d51e3" : {"id":"564944c91be2204b269d51e3","title":"Change Text Inside an Element Using jQuery","videoUrl":"","content":"\nUsing jQuery, you can change the text between the start and end tags of an element. You can even change HTML markup.\njQuery has a function called <code>.html()</code> that lets you add HTML tags and text within an element. Any content previously within the element will be completely replaced with the content you provide using this function.\nHere's how you would rewrite and emphasize the text of our heading:\n<code>$(\"h3\").html(\"&#60;em&#62;jQuery Playground&#60;/em&#62;\");</code>\njQuery also has a similar function called <code>.text()</code> that only alters text without adding tags. In other words, this function will not evaluate any HTML tags passed to it, but will instead treat it as the text you want to replace the existing content with.\nChange the button with id <code>target4</code> by emphasizing its text.\nCheck this <a href=\"https://developer.mozilla.org/en/docs/Web/HTML/Element/em\" target=\"_blank\">link</a> to know more on the difference between <code>&#60;i&#62;</code> and <code>&#60;em&#62;</code> and their uses.\nNote that while the <code>&#60;i&#62;</code> tag has traditionally been used to emphasize text, it has since been coopted for use as a tag for icons. The <code>&#60;em&#62;</code> tag is now widely accepted as the tag for emphasis. Either will work for this challenge.\n"},
"bad87fee1348bd9aed908826" : {"id":"bad87fee1348bd9aed908826","title":"Change the CSS of an Element Using jQuery","videoUrl":"","content":"\nWe can also change the CSS of an HTML element directly with jQuery.\njQuery has a function called <code>.css()</code> that allows you to change the CSS of an element.\nHere's how we would change its color to blue:\n<code>$(\"#target1\").css(\"color\", \"blue\");</code>\nThis is slightly different from a normal CSS declaration, because the CSS property and its value are in quotes, and separated with a comma instead of a colon.\nDelete your jQuery selectors, leaving an empty <code>document ready function</code>.\nSelect <code>target1</code> and change its color to red.\n"},
"bad87fee1348bd9aed508826" : {"id":"bad87fee1348bd9aed508826","title":"Clone an Element Using jQuery","videoUrl":"","content":"\nIn addition to moving elements, you can also copy them from one place to another.\njQuery has a function called <code>clone()</code> that makes a copy of an element.\nFor example, if we wanted to copy <code>target2</code> from our <code>left-well</code> to our <code>right-well</code>, we would use:\n<code>$(\"#target2\").clone().appendTo(\"#right-well\");</code>\nDid you notice this involves sticking two jQuery functions together? This is called <code>function chaining</code> and it's a convenient way to get things done with jQuery.\nClone your <code>target5</code> element and append it to your <code>left-well</code>.\n"},
"bad87fee1348bd9aeda08726" : {"id":"bad87fee1348bd9aeda08726","title":"Delete Your jQuery Functions","videoUrl":"","content":"\nThese animations were cool at first, but now they're getting kind of distracting.\nDelete all three of these jQuery functions from your <code>document ready function</code>, but leave your <code>document ready function</code> itself intact.\n"},
"bad87fee1348bd9aed808826" : {"id":"bad87fee1348bd9aed808826","title":"Disable an Element Using jQuery","videoUrl":"","content":"\nYou can also change the non-CSS properties of HTML elements with jQuery. For example, you can disable buttons.\nWhen you disable a button, it will become grayed-out and can no longer be clicked.\njQuery has a function called <code>.prop()</code> that allows you to adjust the properties of elements.\nHere's how you would disable all buttons:\n<code>$(\"button\").prop(\"disabled\", true);</code>\nDisable only the <code>target1</code> button.\n"},
"bad87fee1348bd9acdd08826" : {"id":"bad87fee1348bd9acdd08826","title":"Learn How Script Tags and Document Ready Work","videoUrl":"","content":"\nNow we're ready to learn jQuery, the most popular JavaScript tool of all time.\nBefore we can start using jQuery, we need to add some things to our HTML.\nFirst, add a <code>script</code> element at the top of your page. Be sure to close it on the following line.\nYour browser will run any JavaScript inside a <code>script</code> element, including jQuery.\nInside your <code>script</code> element, add this code: <code>$(document).ready(function() {</code> to your <code>script</code>. Then close it on the following line (still inside your <code>script</code> element) with: <code>});</code>\nWe'll learn more about <code>functions</code> later. The important thing to know is that code you put inside this <code>function</code> will run as soon as your browser has loaded your page.\nThis is important because without your <code>document ready function</code>, your code may run before your HTML is rendered, which would cause bugs.\n"},
"bad87fee1348bd9aed708826" : {"id":"bad87fee1348bd9aed708826","title":"Remove an Element Using jQuery","videoUrl":"","content":"\nNow let's remove an HTML element from your page using jQuery.\njQuery has a function called <code>.remove()</code> that will remove an HTML element entirely\nRemove element <code>target4</code> from the page by using the <code>.remove()</code> function.\n"},
"bad87fee1348bd9aed918626" : {"id":"bad87fee1348bd9aed918626","title":"Remove Classes from an Element with jQuery","videoUrl":"","content":"\nIn the same way you can add classes to an element with jQuery's <code>addClass()</code> function, you can remove them with jQuery's <code>removeClass()</code> function.\nHere's how you would do this for a specific button:\n<code>$(\"#target2\").removeClass(\"btn-default\");</code>\nLet's remove the <code>btn-default</code> class from all of our <code>button</code> elements.\n"},
"bad87fee1348bd9aed108826" : {"id":"bad87fee1348bd9aed108826","title":"Target a Specific Child of an Element Using jQuery","videoUrl":"","content":"\nYou've seen why id attributes are so convenient for targeting with jQuery selectors. But you won't always have such neat ids to work with.\nFortunately, jQuery has some other tricks for targeting the right elements.\njQuery uses CSS Selectors to target elements. The <code>target:nth-child(n)</code> CSS selector allows you to select all the nth elements with the target class or element type.\nHere's how you would give the third element in each well the bounce class:\n<code>$(\".target:nth-child(3)\").addClass(\"animated bounce\");</code>\nMake the second child in each of your well elements bounce. You must select the elements' children with the <code>target</code> class.\n"},
"bad87fee1348bd9aedc08826" : {"id":"bad87fee1348bd9aedc08826","title":"Target Elements by Class Using jQuery","videoUrl":"","content":"\nYou see how we made all of your <code>button</code> elements bounce? We selected them with <code>$(\"button\")</code>, then we added some CSS classes to them with <code>.addClass(\"animated bounce\");</code>.\nYou just used jQuery's <code>.addClass()</code> function, which allows you to add classes to elements.\nFirst, let's target your <code>div</code> elements with the class <code>well</code> by using the <code>$(\".well\")</code> selector.\nNote that, just like with CSS declarations, you type a <code>.</code> before the class's name.\nThen use jQuery's <code>.addClass()</code> function to add the classes <code>animated</code> and <code>shake</code>.\nFor example, you could make all the elements with the class <code>text-primary</code> shake by adding the following to your <code>document ready function</code>:\n<code>$(\".text-primary\").addClass(\"animated shake\");</code>\n"},
"bad87fee1348bd9aeda08826" : {"id":"bad87fee1348bd9aeda08826","title":"Target Elements by id Using jQuery","videoUrl":"","content":"\nYou can also target elements by their id attributes.\nFirst target your <code>button</code> element with the id <code>target3</code> by using the <code>$(\"#target3\")</code> selector.\nNote that, just like with CSS declarations, you type a <code>#</code> before the id's name.\nThen use jQuery's <code>.addClass()</code> function to add the classes <code>animated</code> and <code>fadeOut</code>.\nHere's how you'd make the <code>button</code> element with the id <code>target6</code> fade out:\n<code>$(\"#target6\").addClass(\"animated fadeOut\")</code>.\n"},
"bad87fee1348bd9aed008826" : {"id":"bad87fee1348bd9aed008826","title":"Target Even Elements Using jQuery","videoUrl":"","content":"\nYou can also target elements based on their positions using <code>:odd</code> or <code>:even</code> selectors.\nNote that jQuery is zero-indexed which means the first element in a selection has a position of 0. This can be a little confusing as, counter-intuitively, <code>:odd</code> selects the second element (position 1), fourth element (position 3), and so on.\nHere's how you would target all the odd elements with class <code>target</code> and give them classes:\n<code>$(\".target:odd\").addClass(\"animated shake\");</code>\nTry selecting all the even <code>target</code> elements and giving them the classes of <code>animated</code> and <code>shake</code>. Remember that <strong>even</strong> refers to the position of elements with a zero-based system in mind.\n"},
"bad87fee1348bd9bedc08826" : {"id":"bad87fee1348bd9bedc08826","title":"Target HTML Elements with Selectors Using jQuery","videoUrl":"","content":"\nNow we have a <code>document ready function</code>.\nNow let's write our first jQuery statement. All jQuery functions start with a <code>$</code>, usually referred to as a <code>dollar sign operator</code>, or as <code>bling</code>.\njQuery often selects an HTML element with a <code>selector</code>, then does something to that element.\nFor example, let's make all of your <code>button</code> elements bounce. Just add this code inside your document ready function:\n<code>$(\"button\").addClass(\"animated bounce\");</code>\nNote that we've already included both the jQuery library and the Animate.css library in the background so that you can use them in the editor. So you are using jQuery to apply the Animate.css <code>bounce</code> class to your <code>button</code> elements.\n"},
"bad87fee1348bd9aed208826" : {"id":"bad87fee1348bd9aed208826","title":"Target the Children of an Element Using jQuery","videoUrl":"","content":"\nWhen HTML elements are placed one level below another they are called <code>children</code> of that element. For example, the button elements in this challenge with the text \"#target1\", \"#target2\", and \"#target3\" are all <code>children</code> of the <code>&#60;div class=\"well\" id=\"left-well\"&#62;</code> element.\njQuery has a function called <code>children()</code> that allows you to access the children of whichever element you've selected.\nHere's an example of how you would use the <code>children()</code> function to give the children of your <code>left-well</code> element the color <code>blue</code>:\n<code>$(\"#left-well\").children().css(\"color\", \"blue\")</code>\n"},
"bad87fee1348bd9aed308826" : {"id":"bad87fee1348bd9aed308826","title":"Target the Parent of an Element Using jQuery","videoUrl":"","content":"\nEvery HTML element has a <code>parent</code> element from which it <code>inherits</code> properties.\nFor example, your <code>jQuery Playground</code> <code>h3</code> element has the parent element of <code>&#60;div class=\"container-fluid\"&#62</code>, which itself has the parent <code>body</code>.\njQuery has a function called <code>parent()</code> that allows you to access the parent of whichever element you've selected.\nHere's an example of how you would use the <code>parent()</code> function if you wanted to give the parent element of the <code>left-well</code> element a background color of blue:\n<code>$(\"#left-well\").parent().css(\"background-color\", \"blue\")</code>\nGive the parent of the <code>#target1</code> element a background-color of red.\n"},
"bad87fee1348bd9aed908626" : {"id":"bad87fee1348bd9aed908626","title":"Target the Same Element with Multiple jQuery Selectors","videoUrl":"","content":"\nNow you know three ways of targeting elements: by type: <code>$(\"button\")</code>, by class: <code>$(\".btn\")</code>, and by id <code>$(\"#target1\")</code>.\nAlthough it is possible to add multiple classes in a single <code>.addClass()</code> call, let's add them to the same element in <em>three separate ways</em>.\nUsing <code>.addClass()</code>, add only one class at a time to the same element, three different ways:\nAdd the <code>animated</code> class to all elements with type <code>button</code>.\nAdd the <code>shake</code> class to all the buttons with class <code>.btn</code>.\nAdd the <code>btn-primary</code> class to the button with id <code>#target1</code>.\n<strong>Note</strong><br>You should only be targeting one element and adding only one class at a time. Altogether, your three individual selectors will end up adding the three classes <code>shake</code>, <code>animated</code>, and <code>btn-primary</code> to <code>#target1</code>.\n"},
"bad87fee1348bd9aed608826" : {"id":"bad87fee1348bd9aed608826","title":"Use appendTo to Move Elements with jQuery","videoUrl":"","content":"\nNow let's try moving elements from one <code>div</code> to another.\njQuery has a function called <code>appendTo()</code> that allows you to select HTML elements and append them to another element.\nFor example, if we wanted to move <code>target4</code> from our right well to our left well, we would use:\n<code>$(\"#target4\").appendTo(\"#left-well\");</code>\nMove your <code>target2</code> element from your <code>left-well</code> to your <code>right-well</code>.\n"},
"bad87fee1348bd9aecb08826" : {"id":"bad87fee1348bd9aecb08826","title":"Use jQuery to Modify the Entire Page","videoUrl":"","content":"\nWe're done playing with our jQuery playground. Let's tear it down!\njQuery can target the <code>body</code> element as well.\nHere's how we would make the entire body fade out: <code> $(\"body\").addClass(\"animated fadeOut\");</code>\nBut let's do something more dramatic. Add the classes <code>animated</code> and <code>hinge</code> to your <code>body</code> element.\n"},
"5a24c314108439a4d403616e" : {"id":"5a24c314108439a4d403616e","title":"Access Props Using this.props","videoUrl":"","content":"\nThe last several challenges covered the basic ways to pass props to child components. But what if the child component that you're passing a prop to is an ES6 class component, rather than a stateless functional component? The ES6 class component uses a slightly different convention to access props.\nAnytime you refer to a class component within itself, you use the <code>this</code> keyword. To access props within a class component, you preface the code that you use to access it with <code>this</code>. For example, if an ES6 class component has a prop called <code>data</code>, you write <code>{this.props.data}</code> in JSX.\n"},
"5a24bbe0dba28a8d3cbd4c5e" : {"id":"5a24bbe0dba28a8d3cbd4c5e","title":"Add Comments in JSX","videoUrl":"","content":"\nJSX is a syntax that gets compiled into valid JavaScript. Sometimes, for readability, you might need to add comments to your code. Like most programming languages, JSX has its own way to do this.\nTo put comments inside JSX, you use the syntax <code>{/* */}</code> to wrap around the comment text.\n"},
"5a24c314108439a4d403617e" : {"id":"5a24c314108439a4d403617e","title":"Add Event Listeners","videoUrl":"","content":"\nThe <code>componentDidMount()</code> method is also the best place to attach any event listeners you need to add for specific functionality. React provides a synthetic event system which wraps the native event system present in browsers. This means that the synthetic event system behaves exactly the same regardless of the user's browser - even if the native events may behave differently between different browsers.\nYou've already been using some of these synthetic event handlers such as <code>onClick()</code>. React's synthetic event system is great to use for most interactions you'll manage on DOM elements. However, if you want to attach an event handler to the document or window objects, you have to do this directly.\n"},
"5a24c314108439a4d4036182" : {"id":"5a24c314108439a4d4036182","title":"Add Inline Styles in React","videoUrl":"","content":"\nYou may have noticed in the last challenge that there were several other syntax differences from HTML inline styles in addition to the <code>style</code> attribute set to a JavaScript object. First, the names of certain CSS style properties use camel case. For example, the last challenge set the size of the font with <code>fontSize</code> instead of <code>font-size</code>. Hyphenated words like <code>font-size</code> are invalid syntax for JavaScript object properties, so React uses camel case. As a rule, any hyphenated style properties are written using camel case in JSX.\nAll property value length units (like <code>height</code>, <code>width</code>, and <code>fontSize</code>) are assumed to be in <code>px</code> unless otherwise specified. If you want to use <code>em</code>, for example, you wrap the value and the units in quotes, like <code>{fontSize: \"4em\"}</code>. Other than the length values that default to <code>px</code>, all other property values should be wrapped in quotes.\n"},
"5a24c314108439a4d4036147" : {"id":"5a24c314108439a4d4036147","title":"Connect Redux to React","videoUrl":"","content":"\nNow that you've written both the <code>mapStateToProps()</code> and the <code>mapDispatchToProps()</code> functions, you can use them to map <code>state</code> and <code>dispatch</code> to the <code>props</code> of one of your React components. The <code>connect</code> method from React Redux can handle this task. This method takes two optional arguments, <code>mapStateToProps()</code> and <code>mapDispatchToProps()</code>. They are optional because you may have a component that only needs access to <code>state</code> but doesn't need to dispatch any actions, or vice versa.\nTo use this method, pass in the functions as arguments, and immediately call the result with your component. This syntax is a little unusual and looks like:\n<code>connect(mapStateToProps, mapDispatchToProps)(MyComponent)</code>\n<strong>Note:</strong>&nbsp;If you want to omit one of the arguments to the <code>connect</code> method, you pass <code>null</code> in its place.\n"},
"5a24c314108439a4d4036148" : {"id":"5a24c314108439a4d4036148","title":"Connect Redux to the Messages App","videoUrl":"","content":"\nNow that you understand how to use <code>connect</code> to connect React to Redux, you can apply what you've learned to your React component that handles messages.\nIn the last lesson, the component you connected to Redux was named <code>Presentational</code>, and this wasn't arbitrary. This term <i>generally</i> refers to React components that are not directly connected to Redux. They are simply responsible for the presentation of UI and do this as a function of the props they receive. By contrast, container components are connected to Redux. These are typically responsible for dispatching actions to the store and often pass store state to child components as props.\n"},
"5a24c314108439a4d4036149" : {"id":"5a24c314108439a4d4036149","title":"Extract Local State into Redux","videoUrl":"","content":"\nYou're almost done! Recall that you wrote all the Redux code so that Redux could control the state management of your React messages app. Now that Redux is connected, you need to extract the state management out of the <code>Presentational</code> component and into Redux. Currently, you have Redux connected, but you are handling the state locally within the <code>Presentational</code> component.\n"},
"5a24c314108439a4d4036143" : {"id":"5a24c314108439a4d4036143","title":"Extract State Logic to Redux","videoUrl":"","content":"\nNow that you finished the React component, you need to move the logic it's performing locally in its <code>state</code> into Redux. This is the first step to connect the simple React app to Redux. The only functionality your app has is to add new messages from the user to an unordered list. The example is simple in order to demonstrate how React and Redux work together.\n"},
"5a24c314108439a4d4036141" : {"id":"5a24c314108439a4d4036141","title":"Getting Started with React Redux","videoUrl":"","content":"\nThis series of challenges introduces how to use Redux with React. First, here's a review of some of the key principles of each technology. React is a view library that you provide with data, then it renders the view in an efficient, predictable way. Redux is a state management framework that you can use to simplify the management of your application's state. Typically, in a React Redux app, you create a single Redux store that manages the state of your entire app. Your React components subscribe to only the pieces of data in the store that are relevant to their role. Then, you dispatch actions directly from React components, which then trigger store updates.\nAlthough React components can manage their own state locally, when you have a complex app, it's generally better to keep the app state in a single location with Redux. There are exceptions when individual components may have local state specific only to them. Finally, because Redux is not designed to work with React out of the box, you need to use the <code>react-redux</code> package. It provides a way for you to pass Redux <code>state</code> and <code>dispatch</code> to your React components as <code>props</code>.\nOver the next few challenges, first, you'll create a simple React component which allows you to input new text messages. These are added to an array that's displayed in the view. This should be a nice review of what you learned in the React lessons. Next, you'll create a Redux store and actions that manage the state of the messages array. Finally, you'll use <code>react-redux</code> to connect the Redux store with your component, thereby extracting the local state into the Redux store.\n"},
"5a24c314108439a4d4036142" : {"id":"5a24c314108439a4d4036142","title":"Manage State Locally First","videoUrl":"","content":"\nHere you'll finish creating the <code>DisplayMessages</code> component.\n"},
"5a24c314108439a4d4036146" : {"id":"5a24c314108439a4d4036146","title":"Map Dispatch to Props","videoUrl":"","content":"\nThe <code>mapDispatchToProps()</code> function is used to provide specific action creators to your React components so they can dispatch actions against the Redux store. It's similar in structure to the <code>mapStateToProps()</code> function you wrote in the last challenge. It returns an object that maps dispatch actions to property names, which become component <code>props</code>. However, instead of returning a piece of <code>state</code>, each property returns a function that calls <code>dispatch</code> with an action creator and any relevant action data. You have access to this <code>dispatch</code> because it's passed in to <code>mapDispatchToProps()</code> as a parameter when you define the function, just like you passed <code>state</code> to <code>mapStateToProps()</code>. Behind the scenes, React Redux is using Redux's <code>store.dispatch()</code> to conduct these dispatches with <code>mapDispatchToProps()</code>. This is similar to how it uses <code>store.subscribe()</code> for components that are mapped to <code>state</code>.\nFor example, you have a <code>loginUser()</code> action creator that takes a <code>username</code> as an action payload. The object returned from <code>mapDispatchToProps()</code> for this action creator would look something like:\n<blockquote>{<br>&nbsp;&nbsp;submitLoginUser: function(username) {<br>&nbsp;&nbsp;&nbsp;&nbsp;dispatch(loginUser(username));<br>&nbsp;&nbsp;}<br>}</blockquote>\n"},
"5a24c314108439a4d4036145" : {"id":"5a24c314108439a4d4036145","title":"Map State to Props","videoUrl":"","content":"\nThe <code>Provider</code> component allows you to provide <code>state</code> and <code>dispatch</code> to your React components, but you must specify exactly what state and actions you want. This way, you make sure that each component only has access to the state it needs. You accomplish this by creating two functions: <code>mapStateToProps()</code> and <code>mapDispatchToProps()</code>.\nIn these functions, you declare what pieces of state you want to have access to and which action creators you need to be able to dispatch. Once these functions are in place, you'll see how to use the React Redux <code>connect</code> method to connect them to your components in another challenge.\n<strong>Note:</strong>&nbsp;Behind the scenes, React Redux uses the <code>store.subscribe()</code> method to implement <code>mapStateToProps()</code>.\n"},
"5a24c314108439a4d403614a" : {"id":"5a24c314108439a4d403614a","title":"Moving Forward From Here","videoUrl":"","content":"\nCongratulations! You finished the lessons on React and Redux. There's one last item worth pointing out before you move on. Typically, you won't write React apps in a code editor like this. This challenge gives you a glimpse of what the syntax looks like if you're working with npm and a file system on your own machine. The code should look similar, except for the use of <code>import</code> statements (these pull in all of the dependencies that have been provided for you in the challenges). The \"Managing Packages with npm\" section covers npm in more detail.\nFinally, writing React and Redux code generally requires some configuration. This can get complicated quickly. If you are interested in experimenting on your own machine, the\n<a id='CRA' target ='_blank' href='https://github.com/facebookincubator/create-react-app'>Create React App</a> comes configured and ready to go.\nAlternatively, you can enable Babel as a JavaScript Preprocessor in CodePen, add React and ReactDOM as external JavaScript resources, and work there as well.\n"},
"5a24c314108439a4d4036144" : {"id":"5a24c314108439a4d4036144","title":"Use Provider to Connect Redux to React","videoUrl":"","content":"\nIn the last challenge, you created a Redux store to handle the messages array and created an action for adding new messages. The next step is to provide React access to the Redux store and the actions it needs to dispatch updates. React Redux provides its <code>react-redux</code> package to help accomplish these tasks.\nReact Redux provides a small API with two key features: <code>Provider</code> and <code>connect</code>. Another challenge covers <code>connect</code>. The <code>Provider</code> is a wrapper component from React Redux that wraps your React app. This wrapper then allows you to access the Redux <code>store</code> and <code>dispatch</code> functions throughout your component tree. <code>Provider</code> takes two props, the Redux store and the child components of your app. Defining the <code>Provider</code> for an App component might look like this:\n<blockquote>&lt;Provider store={store}&gt;<br>&nbsp;&nbsp;&lt;App/&gt;<br>&lt;/Provider&gt;</blockquote>\n"},
"5a24c314108439a4d4036174" : {"id":"5a24c314108439a4d4036174","title":"Bind 'this' to a Class Method","videoUrl":"","content":"\nIn addition to setting and updating <code>state</code>, you can also define methods for your component class. A class method typically needs to use the <code>this</code> keyword so it can access properties on the class (such as <code>state</code> and <code>props</code>) inside the scope of the method. There are a few ways to allow your class methods to access <code>this</code>.\nOne common way is to explicitly bind <code>this</code> in the constructor so <code>this</code> becomes bound to the class methods when the component is initialized. You may have noticed the last challenge used <code>this.handleClick = this.handleClick.bind(this)</code> for its <code>handleClick</code> method in the constructor. Then, when you call a function like <code>this.setState()</code> within your class method, <code>this</code> refers to the class and will not be <code>undefined</code>.\n<strong>Note:</strong>&nbsp;The <code>this</code> keyword is one of the most confusing aspects of JavaScript but it plays an important role in React. Although its behavior here is totally normal, these lessons aren't the place for an in-depth review of <code>this</code> so please refer to other lessons if the above is confusing!\n"},
"5a24c314108439a4d4036189" : {"id":"5a24c314108439a4d4036189","title":"Change Inline CSS Conditionally Based on Component State","videoUrl":"","content":"\nAt this point, you've seen several applications of conditional rendering and the use of inline styles. Here's one more example that combines both of these topics. You can also render CSS conditionally based on the state of a React component. To do this, you check for a condition, and if that condition is met, you modify the styles object that's assigned to the JSX elements in the render method.\nThis paradigm is important to understand because it is a dramatic shift from the more traditional approach of applying styles by modifying DOM elements directly (which is very common with jQuery, for example). In that approach, you must keep track of when elements change and also handle the actual manipulation directly. It can become difficult to keep track of changes, potentially making your UI unpredictable. When you set a style object based on a condition, you describe how the UI should look as a function of the application's state. There is a clear flow of information that only moves in one direction. This is the preferred method when writing applications with React.\n"},
"5a24c314108439a4d4036166" : {"id":"5a24c314108439a4d4036166","title":"Compose React Components","videoUrl":"","content":"\nAs the challenges continue to use more complex compositions with React components and JSX, there is one important point to note. Rendering ES6 style class components within other components is no different than rendering the simple components you used in the last few challenges. You can render JSX elements, stateless functional components, and ES6 class components within other components.\n"},
"5a24bbe0dba28a8d3cbd4c5d" : {"id":"5a24bbe0dba28a8d3cbd4c5d","title":"Create a Complex JSX Element","videoUrl":"","content":"\nThe last challenge was a simple example of JSX, but JSX can represent more complex HTML as well.\nOne important thing to know about nested JSX is that it must return a single element.\nThis one parent element would wrap all of the other levels of nested elements.\nFor instance, several JSX elements written as siblings with no parent wrapper element will not transpile.\nHere's an example:\n<b>Valid JSX:</b>\n<blockquote>&lt;div&gt;<br>&nbsp;&nbsp;&lt;p&gt;Paragraph One&lt;/p&gt;<br>&nbsp;&nbsp;&lt;p&gt;Paragraph Two&lt;/p&gt;<br>&nbsp;&nbsp;&lt;p&gt;Paragraph Three&lt;/p&gt;<br>&lt;/div&gt;</blockquote>\n<b>Invalid JSX:</b>\n<blockquote>&lt;p&gt;Paragraph One&lt;/p&gt;<br>&lt;p&gt;Paragraph Two&lt;/p&gt;<br>&lt;p&gt;Paragraph Three&lt;/p&gt;<br></blockquote>\n"},
"5a24c314108439a4d4036164" : {"id":"5a24c314108439a4d4036164","title":"Create a Component with Composition","videoUrl":"","content":"\nNow we will look at how we can compose multiple React components together. Imagine you are building an App and have created three components, a <code>Navbar</code>, <code>Dashboard</code>, and <code>Footer</code>.\nTo compose these components together, you could create an <code>App</code> <i>parent</i> component which renders each of these three components as <i>children</i>. To render a component as a child in a React component, you include the component name written as a custom HTML tag in the JSX. For example, in the <code>render</code> method you could write:\n<blockquote>return (<br> &lt;App&gt;<br>&nbsp;&nbsp;&lt;Navbar /&gt;<br>&nbsp;&nbsp;&lt;Dashboard /&gt;<br>&nbsp;&nbsp;&lt;Footer /&gt;<br> &lt;/App&gt;<br>)</blockquote>\nWhen React encounters a custom HTML tag that references another component (a component name wrapped in <code>&lt; /&gt;</code> like in this example), it renders the markup for that component in the location of the tag. This should illustrate the parent/child relationship between the <code>App</code> component and the <code>Navbar</code>, <code>Dashboard</code>, and <code>Footer</code>.\n"},
"5a24c314108439a4d4036179" : {"id":"5a24c314108439a4d4036179","title":"Create a Controlled Form","videoUrl":"","content":"\nThe last challenge showed that React can control the internal state for certain elements like <code>input</code> and <code>textarea</code>, which makes them controlled components. This applies to other form elements as well, including the regular HTML <code>form</code> element.\n"},
"5a24c314108439a4d4036178" : {"id":"5a24c314108439a4d4036178","title":"Create a Controlled Input","videoUrl":"","content":"\nYour application may have more complex interactions between <code>state</code> and the rendered UI. For example, form control elements for text input, such as <code>input</code> and <code>textarea</code>, maintain their own state in the DOM as the user types. With React, you can move this mutable state into a React component's <code>state</code>. The user's input becomes part of the application <code>state</code>, so React controls the value of that input field. Typically, if you have React components with input fields the user can type into, it will be a controlled input form.\n"},
"5a24c314108439a4d4036163" : {"id":"5a24c314108439a4d4036163","title":"Create a React Component","videoUrl":"","content":"\nThe other way to define a React component is with the ES6 <code>class</code> syntax. In the following example, <code>Kitten</code> extends <code>React.Component</code>:\n<blockquote>class Kitten extends React.Component {<br>&nbsp;&nbsp;constructor(props) {<br>&nbsp;&nbsp;&nbsp;&nbsp;super(props);<br>&nbsp;&nbsp;}<br><br>&nbsp;&nbsp;render() {<br>&nbsp;&nbsp;&nbsp;&nbsp;return (<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;h1&gt;Hi&lt;/h1&gt;<br>&nbsp;&nbsp;&nbsp;&nbsp;);<br>&nbsp;&nbsp;}<br>}</blockquote>\nThis creates an ES6 class <code>Kitten</code> which extends the <code>React.Component</code> class. So the <code>Kitten</code> class now has access to many useful React features, such as local state and lifecycle hooks. Don't worry if you aren't familiar with these terms yet, they will be covered in greater detail in later challenges.\nAlso notice the <code>Kitten</code> class has a <code>constructor</code> defined within it that calls <code>super()</code>. It uses <code>super()</code> to call the constructor of the parent class, in this case <code>React.Component</code>. The constructor is a special method used during the initialization of objects that are created with the <code>class</code> keyword. It is best practice to call a component's <code>constructor</code> with <code>super</code>, and pass <code>props</code> to both. This makes sure the component is initialized properly. For now, know that it is standard for this code to be included. Soon you will see other uses for the constructor as well as <code>props</code>.\n"},
"587d7dbc367417b2b2512bb1" : {"id":"587d7dbc367417b2b2512bb1","title":"Create a Simple JSX Element","videoUrl":"","content":"\n<strong>Intro:</strong> React is an Open Source view library created and maintained by Facebook. It's a great tool to render the User Interface (UI) of modern web applications.\nReact uses a syntax extension of JavaScript called JSX that allows you to write HTML directly within JavaScript. This has several benefits. It lets you use the full programmatic power of JavaScript within HTML, and helps to keep your code readable. For the most part, JSX is similar to the HTML that you have already learned, however there are a few key differences that will be covered throughout these challenges.\nFor instance, because JSX is a syntactic extension of JavaScript, you can actually write JavaScript directly within JSX. To do this, you simply include the code you want to be treated as JavaScript within curly braces: <code>{ 'this is treated as JavaScript code' }</code>. Keep this in mind, since it's used in several future challenges.\nHowever, because JSX is not valid JavaScript, JSX code must be compiled into JavaScript. The transpiler Babel is a popular tool for this process. For your convenience, it's already added behind the scenes for these challenges. If you happen to write syntactically invalid JSX, you will see the first test in these challenges fail.\nIt's worth noting that under the hood the challenges are calling <code>ReactDOM.render(JSX, document.getElementById('root'))</code>. This function call is what places your JSX into React's own lightweight representation of the DOM. React then uses snapshots of its own DOM to optimize updating only specific parts of the actual DOM.\n"},
"5a24c314108439a4d4036170" : {"id":"5a24c314108439a4d4036170","title":"Create a Stateful Component","videoUrl":"","content":"\nOne of the most important topics in React is <code>state</code>. State consists of any data your application needs to know about, that can change over time. You want your apps to respond to state changes and present an updated UI when necessary. React offers a nice solution for the state management of modern web applications.\nYou create state in a React component by declaring a <code>state</code> property on the component class in its <code>constructor</code>. This initializes the component with <code>state</code> when it is created. The <code>state</code> property must be set to a JavaScript <code>object</code>. Declaring it looks like this:\n<blockquote>this.state = {<br>&nbsp;&nbsp;// describe your state here<br>}</code>\nYou have access to the <code>state</code> object throughout the life of your component. You can update it, render it in your UI, and pass it as props to child components. The <code>state</code> object can be as complex or as simple as you need it to be. Note that you must create a class component by extending <code>React.Component</code> in order to create <code>state</code> like this.\n"},
"5a24c314108439a4d4036162" : {"id":"5a24c314108439a4d4036162","title":"Create a Stateless Functional Component","videoUrl":"","content":"\nComponents are the core of React. Everything in React is a component and here you will learn how to create one.\nThere are two ways to create a React component. The first way is to use a JavaScript function. Defining a component in this way creates a <em>stateless functional component</em>. The concept of state in an application will be covered in later challenges. For now, think of a stateless component as one that can receive data and render it, but does not manage or track changes to that data. (We'll cover the second way to create a React component in the next challenge.)\nTo create a component with a function, you simply write a JavaScript function that returns either JSX or <code>null</code>. One important thing to note is that React requires your function name to begin with a capital letter. Here's an example of a stateless functional component that assigns an HTML class in JSX:\n<blockquote>// After being transpiled, the &lt;div&gt; will have a CSS class of 'customClass'<br>const DemoComponent = function() {<br>&nbsp;&nbsp;return (<br>&nbsp;&nbsp;&nbsp;&nbsp;&lt;div className='customClass' /&gt;<br>&nbsp;&nbsp;);<br>};</blockquote>\nBecause a JSX component represents HTML, you could put several components together to create a more complex HTML page. This is one of the key advantages of the component architecture React provides. It allows you to compose your UI from many separate, isolated components. This makes it easier to build and maintain complex user interfaces.\n"},
"5a24c314108439a4d4036160" : {"id":"5a24c314108439a4d4036160","title":"Define an HTML Class in JSX","videoUrl":"","content":"\nNow that you're getting comfortable writing JSX, you may be wondering how it differs from HTML.\nSo far, it may seem that HTML and JSX are exactly the same.\nOne key difference in JSX is that you can no longer use the word <code>class</code> to define HTML classes. This is because <code>class</code> is a reserved word in JavaScript. Instead, JSX uses <code>className</code>.\nIn fact, the naming convention for all HTML attributes and event references in JSX become camelCase. For example, a click event in JSX is <code>onClick</code>, instead of <code>onclick</code>. Likewise, <code>onchange</code> becomes <code>onChange</code>. While this is a subtle difference, it is an important one to keep in mind moving forward.\n"},
"5a24c314108439a4d403618b" : {"id":"5a24c314108439a4d403618b","title":"Give Sibling Elements a Unique Key Attribute","videoUrl":"","content":"\nThe last challenge showed how the <code>map</code> method is used to dynamically render a number of elements based on user input. However, there was an important piece missing from that example. When you create an array of elements, each one needs a <code>key</code> attribute set to a unique value. React uses these keys to keep track of which items are added, changed, or removed. This helps make the re-rendering process more efficient when the list is modified in any way. Note that keys only need to be unique between sibling elements, they don't need to be globally unique in your application.\n"},
"5a24c314108439a4d4036181" : {"id":"5a24c314108439a4d4036181","title":"Introducing Inline Styles","videoUrl":"","content":"\nThere are other complex concepts that add powerful capabilities to your React code. But you may be wondering about the more simple problem of how to style those JSX elements you create in React. You likely know that it won't be exactly the same as working with HTML because of <a target=\"_blank\" href=\"front-end-libraries/react/define-an-html-class-in-jsx\"> the way you apply classes to JSX elements</a>.\nIf you import styles from a stylesheet, it isn't much different at all. You apply a class to your JSX element using the <code>className</code> attribute, and apply styles to the class in your stylesheet. Another option is to apply <strong><em>inline</em></strong> styles, which are very common in ReactJS development.\nYou apply inline styles to JSX elements similar to how you do it in HTML, but with a few JSX differences. Here's an example of an inline style in HTML:\n<code>&lt;div style=\"color: yellow; font-size: 16px\"&gt;Mellow Yellow&lt;/div&gt;</code>\nJSX elements use the <code>style</code> attribute, but because of the way JSX is transpiled, you can't set the value to a <code>string</code>. Instead, you set it equal to a JavaScript <code>object</code>. Here's an example:\n<code>&lt;div style={{color: \"yellow\", fontSize: 16}}&gt;Mellow Yellow&lt;/div&gt;</code>\nNotice how we camelCase the \"fontSize\" property? This is because React will not accept kebab-case keys in the style object. React will apply the correct property name for us in the HTML.\n"},
"5a24c314108439a4d4036161" : {"id":"5a24c314108439a4d4036161","title":"Learn About Self-Closing JSX Tags","videoUrl":"","content":"\nSo far, youve seen how JSX differs from HTML in a key way with the use of <code>className</code> vs. <code>class</code> for defining HTML classes.\nAnother important way in which JSX differs from HTML is in the idea of the self-closing tag.\nIn HTML, almost all tags have both an opening and closing tag: <code>&lt;div&gt;&lt;/div&gt;</code>; the closing tag always has a forward slash before the tag name that you are closing. However, there are special instances in HTML called self-closing tags, or tags that dont require both an opening and closing tag before another tag can start.\nFor example the line-break tag can be written as <code>&lt;br&gt;</code> or as <code>&lt;br /&gt;</code>, but should never be written as <code>&lt;br&gt;&lt;/br&gt;</code>, since it doesn't contain any content.\nIn JSX, the rules are a little different. Any JSX element can be written with a self-closing tag, and every element must be closed. The line-break tag, for example, must always be written as <code>&lt;br /&gt;</code> in order to be valid JSX that can be transpiled. A <code>&lt;div&gt;</code>, on the other hand, can be written as <code>&lt;div /&gt;</code> or <code>&lt;div&gt;&lt;/div&gt;</code>. The difference is that in the first syntax version there is no way to include anything in the <code>&lt;div /&gt;</code>. You will see in later challenges that this syntax is useful when rendering React components.\n"},
"5a24c314108439a4d403617f" : {"id":"5a24c314108439a4d403617f","title":"Manage Updates with Lifecycle Methods","videoUrl":"","content":"\nAnother lifecycle method is <code>componentWillReceiveProps()</code> which is called whenever a component is receiving new props. This method receives the new props as an argument, which is usually written as <code>nextProps</code>. You can use this argument and compare with <code>this.props</code> and perform actions before the component updates. For example, you may call <code>setState()</code> locally before the update is processed.\nAnother method is <code>componentDidUpdate()</code>, and is called immediately after a component re-renders. Note that rendering and mounting are considered different things in the component lifecycle. When a page first loads, all components are mounted and this is where methods like <code>componentWillMount()</code> and <code>componentDidMount()</code> are called. After this, as state changes, components re-render themselves. The next challenge covers this in more detail.\n"},
"5a24c314108439a4d4036180" : {"id":"5a24c314108439a4d4036180","title":"Optimize Re-Renders with shouldComponentUpdate","videoUrl":"","content":"\nSo far, if any component receives new <code>state</code> or new <code>props</code>, it re-renders itself and all its children. This is usually okay. But React provides a lifecycle method you can call when child components receive new <code>state</code> or <code>props</code>, and declare specifically if the components should update or not. The method is <code>shouldComponentUpdate()</code>, and it takes <code>nextProps</code> and <code>nextState</code> as parameters.\nThis method is a useful way to optimize performance. For example, the default behavior is that your component re-renders when it receives new <code>props</code>, even if the <code>props</code> haven't changed. You can use <code>shouldComponentUpdate()</code> to prevent this by comparing the <code>props</code>. The method must return a <code>boolean</code> value that tells React whether or not to update the component. You can compare the current props (<code>this.props</code>) to the next props (<code>nextProps</code>) to determine if you need to update or not, and return <code>true</code> or <code>false</code> accordingly.\n"},
"5a24c314108439a4d403616c" : {"id":"5a24c314108439a4d403616c","title":"Override Default Props","videoUrl":"","content":"\nThe ability to set default props is a useful feature in React. The way to override the default props is to explicitly set the prop values for a component.\n"},
"5a24c314108439a4d403617b" : {"id":"5a24c314108439a4d403617b","title":"Pass a Callback as Props","videoUrl":"","content":"\nYou can pass <code>state</code> as props to child components, but you're not limited to passing data. You can also pass handler functions or any method that's defined on a React component to a child component. This is how you allow child components to interact with their parent components. You pass methods to a child just like a regular prop. It's assigned a name and you have access to that method name under <code>this.props</code> in the child component.\n"},
"5a24c314108439a4d403616a" : {"id":"5a24c314108439a4d403616a","title":"Pass an Array as Props","videoUrl":"","content":"\nThe last challenge demonstrated how to pass information from a parent component to a child component as <code>props</code> or properties. This challenge looks at how arrays can be passed as <code>props</code>.  To pass an array to a JSX element, it must be treated as JavaScript and wrapped in curly braces.\n<blockquote>&lt;ParentComponent&gt;<br>&nbsp;&nbsp;&lt;ChildComponent colors={[\"green\", \"blue\", \"red\"]} /&gt;<br>&lt;/ParentComponent&gt;</blockquote>\nThe child component then has access to the array property <code>colors</code>.  Array methods such as <code>join()</code> can be used when accessing the property.\n<code>const ChildComponent = (props) => &lt;p&gt{props.colors.join(', ')}&lt;/p&gt</code>\nThis will join all <code>colors</code> array items into a comma separated string and produce:\n <code> &lt;p&gt;green, blue, red&lt;/p&gt;</code>\nLater, we will learn about other common methods to render arrays of data in React.\n"},
"5a24c314108439a4d4036169" : {"id":"5a24c314108439a4d4036169","title":"Pass Props to a Stateless Functional Component","videoUrl":"","content":"\nThe previous challenges covered a lot about creating and composing JSX elements, functional components, and ES6 style class components in React. With this foundation, it's time to look at another feature very common in React: <b>props</b>. In React, you can pass props, or properties, to child components. Say you have an <code>App</code> component which renders a child component called <code>Welcome</code> that is a stateless functional component. You can pass <code>Welcome</code> a <code>user</code> property by writing:\n<blockquote>&lt;App&gt;<br>&nbsp;&nbsp;&lt;Welcome user='Mark' /&gt;<br>&lt;/App&gt;</blockquote>\nYou use <strong>custom HTML attributes</strong> that React provides support for to pass the property <code>user</code> to the component <code>Welcome</code>. Since <code>Welcome</code> is a stateless functional component, it has access to this value like so:\n<blockquote>const Welcome = (props) => &lt;h1&gt;Hello, {props.user}!&lt;/h1&gt;</blockquote>\nIt is standard to call this value <code>props</code> and when dealing with stateless functional components, you basically consider it as an argument to a function which returns JSX. You can access the value of the argument in the function body. With class components, you will see this is a little different.\n"},
"5a24c314108439a4d403617a" : {"id":"5a24c314108439a4d403617a","title":"Pass State as Props to Child Components","videoUrl":"","content":"\nYou saw a lot of examples that passed props to child JSX elements and child React components in previous challenges. You may be wondering where those props come from. A common pattern is to have a stateful component containing the <code>state</code> important to your app, that then renders child components. You want these components to have access to some pieces of that <code>state</code>, which are passed in as props.\nFor example, maybe you have an <code>App</code> component that renders a <code>Navbar</code>, among other components. In your <code>App</code>, you have <code>state</code> that contains a lot of user information, but the <code>Navbar</code> only needs access to the user's username so it can display it. You pass that piece of <code>state</code> to the <code>Navbar</code> component as a prop.\nThis pattern illustrates some important paradigms in React. The first is <em>unidirectional data flow</em>. State flows in one direction down the tree of your application's components, from the stateful parent component to child components. The child components only receive the state data they need. The second is that complex stateful apps can be broken down into just a few, or maybe a single, stateful component. The rest of your components simply receive state from the parent as props, and render a UI from that state. It begins to create a separation where state management is handled in one part of code and UI rendering in another. This principle of separating state logic from UI logic is one of React's key principles. When it's used correctly, it makes the design of complex, stateful applications much easier to manage.\n"},
"5a24c314108439a4d4036167" : {"id":"5a24c314108439a4d4036167","title":"Render a Class Component to the DOM","videoUrl":"","content":"\nYou may remember using the ReactDOM API in an earlier challenge to render JSX elements to the DOM. The process for rendering React components will look very similar. The past few challenges focused on components and composition, so the rendering was done for you behind the scenes. However, none of the React code you write will render to the DOM without making a call to the ReactDOM API.\nHere's a refresher on the syntax: <code>ReactDOM.render(componentToRender, targetNode)</code>. The first argument is the React component that you want to render. The second argument is the DOM node that you want to render that component within.\nReact components are passed into <code>ReactDOM.render()</code> a little differently than JSX elements. For JSX elements, you pass in the name of the element that you want to render. However, for React components, you need to use the same syntax as if you were rendering a nested component, for example <code>ReactDOM.render(&lt;ComponentToRender /&gt;, targetNode)</code>. You use this syntax for both ES6 class components and functional components.\n"},
"5a24c314108439a4d4036188" : {"id":"5a24c314108439a4d4036188","title":"Render Conditionally from Props","videoUrl":"","content":"\nSo far, you've seen how to use <code>if/else</code>, <code>&&,</code> <code>null</code> and the ternary operator (<code>condition ? expressionIfTrue : expressionIfFalse</code>) to make conditional decisions about what to render and when. However, there's one important topic left to discuss that lets you combine any or all of these concepts with another powerful React feature: props. Using props to conditionally render code is very common with React developers &mdash; that is, they use the value of a given prop to automatically make decisions about what to render.\nIn this challenge, you'll set up a child component to make rendering decisions based on props. You'll also use the ternary operator, but you can see how several of the other concepts that were covered in the last few challenges might be just as useful in this context.\n"},
"5a24bbe0dba28a8d3cbd4c5f" : {"id":"5a24bbe0dba28a8d3cbd4c5f","title":"Render HTML Elements to the DOM","videoUrl":"","content":"\nSo far, you've learned that JSX is a convenient tool to write readable HTML within JavaScript. With React, we can render this JSX directly to the HTML DOM using React's rendering API known as ReactDOM.\nReactDOM offers a simple method to render React elements to the DOM which looks like this: <code>ReactDOM.render(componentToRender, targetNode)</code>, where the first argument is the React element or component that you want to render, and the second argument is the DOM node that you want to render the component to.\nAs you would expect, <code>ReactDOM.render()</code> must be called after the JSX element declarations, just like how you must declare variables before using them.\n"},
"5a24c314108439a4d403618d" : {"id":"5a24c314108439a4d403618d","title":"Render React on the Server with renderToString","videoUrl":"","content":"\nSo far, you have been rendering React components on the client. Normally, this is what you will always do. However, there are some use cases where it makes sense to render a React component on the server. Since React is a JavaScript view library and you can run JavaScript on the server with Node, this is possible. In fact, React provides a <code>renderToString()</code> method you can use for this purpose.\nThere are two key reasons why rendering on the server may be used in a real world app. First, without doing this, your React apps would consist of a relatively empty HTML file and a large bundle of JavaScript when it's initially loaded to the browser. This may not be ideal for search engines that are trying to index the content of your pages so people can find you. If you render the initial HTML markup on the server and send this to the client, the initial page load contains all of the page's markup which can be crawled by search engines. Second, this creates a faster initial page load experience because the rendered HTML is smaller than the JavaScript code of the entire app. React will still be able to recognize your app and manage it after the initial load.\n"},
"5a24c314108439a4d4036172" : {"id":"5a24c314108439a4d4036172","title":"Render State in the User Interface Another Way","videoUrl":"","content":"\nThere is another way to access <code>state</code> in a component. In the <code>render()</code> method, before the <code>return</code> statement, you can write JavaScript directly. For example, you could declare functions, access data from <code>state</code> or <code>props</code>, perform computations on this data, and so on. Then, you can assign any data to variables, which you have access to in the <code>return</code> statement.\n"},
"5a24c314108439a4d4036171" : {"id":"5a24c314108439a4d4036171","title":"Render State in the User Interface","videoUrl":"","content":"\nOnce you define a component's initial state, you can display any part of it in the UI that is rendered. If a component is stateful, it will always have access to the data in <code>state</code> in its <code>render()</code> method. You can access the data with <code>this.state</code>.\nIf you want to access a state value within the <code>return</code> of the render method, you have to enclose the value in curly braces.\n<code>State</code> is one of the most powerful features of components in React. It allows you to track important data in your app and render a UI in response to changes in this data. If your data changes, your UI will change. React uses what is called a virtual DOM, to keep track of changes behind the scenes. When state data updates, it triggers a re-render of the components using that data - including child components that received the data as a prop. React updates the actual DOM, but only where necessary. This means you don't have to worry about changing the DOM. You simply declare what the UI should look like.\nNote that if you make a component stateful, no other components are aware of its <code>state</code>. Its <code>state</code> is completely encapsulated, or local to that component, unless you pass state data to a child component as <code>props</code>. This notion of encapsulated <code>state</code> is very important because it allows you to write certain logic, then have that logic contained and isolated in one place in your code.\n"},
"5a24c314108439a4d4036184" : {"id":"5a24c314108439a4d4036184","title":"Render with an If-Else Condition","videoUrl":"","content":"\nAnother application of using JavaScript to control your rendered view is to tie the elements that are rendered to a condition. When the condition is true, one view renders. When it's false, it's a different view. You can do this with a standard <code>if/else</code> statement in the <code>render()</code> method of a React component.\n"},
"5a24c314108439a4d403616f" : {"id":"5a24c314108439a4d403616f","title":"Review Using Props with Stateless Functional Components","videoUrl":"","content":"\nExcept for the last challenge, you've been passing props to stateless functional components. These components act like pure functions. They accept props as input and return the same view every time they are passed the same props. You may be wondering what state is, and the next challenge will cover it in more detail. Before that, here's a review of the terminology for components.\nA <em>stateless functional component</em> is any function you write which accepts props and returns JSX. A <em>stateless component</em>, on the other hand, is a class that extends <code>React.Component</code>, but does not use internal state (covered in the next challenge). Finally, a <em>stateful component</em> is any component that does maintain its own internal state. You may see stateful components referred to simply as components or React components.\nA common pattern is to try to minimize statefulness and to create stateless functional components wherever possible. This helps contain your state management to a specific area of your application. In turn, this improves development and maintenance of your app by making it easier to follow how changes to state affect its behavior.\n"},
"5a24c314108439a4d4036173" : {"id":"5a24c314108439a4d4036173","title":"Set State with this.setState","videoUrl":"","content":"\nThe previous challenges covered component <code>state</code> and how to initialize state in the <code>constructor</code>. There is also a way to change the component's <code>state</code>. React provides a method for updating component <code>state</code> called <code>setState</code>. You call the <code>setState</code> method within your component class like so: <code>this.setState()</code>, passing in an object with key-value pairs. The keys are your state properties and the values are the updated state data. For instance, if we were storing a <code>username</code> in state and wanted to update it, it would look like this:\n<blockquote>this.setState({<br>&nbsp;&nbsp;username: 'Lewis'<br>});</blockquote>\nReact expects you to never modify <code>state</code> directly, instead always use <code>this.setState()</code> when state changes occur. Also, you should note that React may batch multiple state updates in order to improve performance. What this means is that state updates through the <code>setState</code> method can be asynchronous. There is an alternative syntax for the <code>setState</code> method which provides a way around this problem. This is rarely needed but it's good to keep it in mind! Please consult the <a target=\"_blank\" href=\"https://facebook.github.io/react/docs/state-and-lifecycle.html\">React documentation</a> for further details.\n"},
"5a24c314108439a4d4036183" : {"id":"5a24c314108439a4d4036183","title":"Use Advanced JavaScript in React Render Method","videoUrl":"","content":"\nIn previous challenges, you learned how to inject JavaScript code into JSX code using curly braces, <code>{ }</code>, for tasks like accessing props, passing props, accessing state, inserting comments into your code, and most recently, styling your components. These are all common use cases to put JavaScript in JSX, but they aren't the only way that you can utilize JavaScript code in your React components.\nYou can also write JavaScript directly in your <code>render</code> methods, before the <code>return</code> statement, <strong><em>without</em></strong> inserting it inside of curly braces. This is because it is not yet within the JSX code. When you want to use a variable later in the JSX code <em>inside</em> the <code>return</code> statement, you place the variable name inside curly braces.\n"},
"5a24c314108439a4d403618c" : {"id":"5a24c314108439a4d403618c","title":"Use Array.filter() to Dynamically Filter an Array","videoUrl":"","content":"\nThe <code>map</code> array method is a powerful tool that you will use often when working with React. Another method related to <code>map</code> is <code>filter</code>, which filters the contents of an array based on a condition, then returns a new array. For example, if you have an array of users that all have a property <code>online</code> which can be set to <code>true</code> or <code>false</code>, you can filter only those users that are online by writing:\n<code>let onlineUsers = users.filter(user => user.online);</code>\n"},
"5a24c314108439a4d403618a" : {"id":"5a24c314108439a4d403618a","title":"Use Array.map() to Dynamically Render Elements","videoUrl":"","content":"\nConditional rendering is useful, but you may need your components to render an unknown number of elements. Often in reactive programming, a programmer has no way to know what the state of an application is until runtime, because so much depends on a user's interaction with that program. Programmers need to write their code to correctly handle that unknown state ahead of time. Using <code>Array.map()</code> in React illustrates this concept.\nFor example, you create a simple \"To Do List\" app. As the programmer, you have no way of knowing how many items a user might have on their list. You need to set up your component to <em><strong>dynamically render</strong></em> the correct number of list elements long before someone using the program decides that today is laundry day.\n"},
"5a24c314108439a4d4036187" : {"id":"5a24c314108439a4d4036187","title":"Use a Ternary Expression for Conditional Rendering","videoUrl":"","content":"\nBefore moving on to dynamic rendering techniques, there's one last way to use built-in JavaScript conditionals to render what you want: the <em><strong>ternary operator</strong></em>. The ternary operator is often utilized as a shortcut for <code>if/else</code> statements in JavaScript. They're not quite as robust as traditional <code>if/else</code> statements, but they are very popular among React developers. One reason for this is because of how JSX is compiled, <code>if/else</code> statements can't be inserted directly into JSX code. You might have noticed this a couple challenges ago &mdash; when an <code>if/else</code> statement was required, it was always <em>outside</em> the <code>return</code> statement. Ternary expressions can be an excellent alternative if you want to implement conditional logic within your JSX. Recall that a ternary operator has three parts, but you can combine several ternary expressions together. Here's the basic syntax:\n<blockquote>condition ? expressionIfTrue : expressionIfFalse</blockquote>\n"},
"5a24c314108439a4d403616b" : {"id":"5a24c314108439a4d403616b","title":"Use Default Props","videoUrl":"","content":"\nReact also has an option to set default props. You can assign default props to a component as a property on the component itself and React assigns the default prop if necessary. This allows you to specify what a prop value should be if no value is explicitly provided. For example, if you declare <code>MyComponent.defaultProps = { location: 'San Francisco' }</code>, you have defined a location prop that's set to the string <code>San Francisco</code>, unless you specify otherwise. React assigns default props if props are undefined, but if you pass <code>null</code> as the value for a prop, it will remain <code>null</code>.\n"},
"5a24c314108439a4d4036185" : {"id":"5a24c314108439a4d4036185","title":"Use && for a More Concise Conditional","videoUrl":"","content":"\nThe if/else statements worked in the last challenge, but there's a more concise way to achieve the same result. Imagine that you are tracking several conditions in a component and you want different elements to render depending on each of these conditions. If you write a lot of <code>else if</code> statements to return slightly different UIs, you may repeat code which leaves room for error. Instead, you can use the <code>&&</code> logical operator to perform conditional logic in a more concise way. This is possible because you want to check if a condition is <code>true</code>, and if it is, return some markup. Here's an example:\n<code>{condition && &lt;p&gt;markup&lt;/p&gt;}</code>\nIf the <code>condition</code> is <code>true</code>, the markup will be returned. If the condition is <code>false</code>, the operation will immediately return <code>false</code> after evaluating the <code>condition</code> and return nothing. You can include these statements directly in your JSX and string multiple conditions together by writing <code>&&</code> after each one. This allows you to handle more complex conditional logic in your <code>render()</code> method without repeating a lot of code.\n"},
"5a24c314108439a4d403616d" : {"id":"5a24c314108439a4d403616d","title":"Use PropTypes to Define the Props You Expect","videoUrl":"","content":"\nReact provides useful type-checking features to verify that components receive props of the correct type. For example, your application makes an API call to retrieve data that you expect to be in an array, which is then passed to a component as a prop. You can set <code>propTypes</code> on your component to require the data to be of type <code>array</code>. This will throw a useful warning when the data is of any other type.\nIt's considered a best practice to set <code>propTypes</code> when you know the type of a prop ahead of time. You can define a <code>propTypes</code> property for a component in the same way you defined <code>defaultProps</code>. Doing this will check that props of a given key are present with a given type. Here's an example to require the type <code>function</code> for a prop called <code>handleClick</code>:\n<code>MyComponent.propTypes = { handleClick: PropTypes.func.isRequired }</code>\nIn the example above, the <code>PropTypes.func</code> part checks that <code>handleClick</code> is a function. Adding <code>isRequired</code> tells React that <code>handleClick</code> is a required property for that component. You will see a warning if that prop isn't provided. Also notice that <code>func</code> represents <code>function</code>. Among the seven JavaScript primitive types, <code>function</code> and <code>boolean</code> (written as <code>bool</code>) are the only two that use unusual spelling. In addition to the primitive types, there are other types available. For example, you can check that a prop is a React element. Please refer to the [documentation](https://reactjs.org/docs/jsx-in-depth.html#specifying-the-react-element-type) for all of the options.\n<strong>Note:</strong> As of React v15.5.0, <code>PropTypes</code> is imported independently from React, like this:\n<code>import React, { PropTypes } from 'react';</code>\n"},
"5a24c314108439a4d4036165" : {"id":"5a24c314108439a4d4036165","title":"Use React to Render Nested Components","videoUrl":"","content":"\nThe last challenge showed a simple way to compose two components, but there are many different ways you can compose components with React.\nComponent composition is one of React's powerful features. When you work with React, it is important to start thinking about your user interface in terms of components like the App example in the last challenge. You break down your UI into its basic building blocks, and those pieces become the components. This helps to separate the code responsible for the UI from the code responsible for handling your application logic. It can greatly simplify the development and maintenance of complex projects.\n"},
"5a24c314108439a4d4036176" : {"id":"5a24c314108439a4d4036176","title":"Use State to Toggle an Element","videoUrl":"","content":"\nYou can use <code>state</code> in React applications in more complex ways than what you've seen so far. One example is to monitor the status of a value, then render the UI conditionally based on this value. There are several different ways to accomplish this, and the code editor shows one method.\n"},
"5a24c314108439a4d403617d" : {"id":"5a24c314108439a4d403617d","title":"Use the Lifecycle Method componentDidMount","videoUrl":"","content":"\nMost web developers, at some point, need to call an API endpoint to retrieve data. If you're working with React, it's important to know where to perform this action.\nThe best practice with React is to place API calls or any calls to your server in the lifecycle method <code>componentDidMount()</code>. This method is called after a component is mounted to the DOM. Any calls to <code>setState()</code> here will trigger a re-rendering of your component. When you call an API in this method, and set your state with the data that the API returns, it will automatically trigger an update once you receive the data.\n"},
"5a24c314108439a4d403617c" : {"id":"5a24c314108439a4d403617c","title":"Use the Lifecycle Method componentWillMount","videoUrl":"","content":"\nReact components have several special methods that provide opportunities to perform actions at specific points in the lifecycle of a component. These are called lifecycle methods, or lifecycle hooks, and allow you to catch components at certain points in time. This can be before they are rendered, before they update, before they receive props, before they unmount, and so on. Here is a list of some of the main lifecycle methods:\n<code>componentWillMount()</code>\n<code>componentDidMount()</code>\n<code>componentWillReceiveProps()</code>\n<code>shouldComponentUpdate()</code>\n<code>componentWillUpdate()</code>\n<code>componentDidUpdate()</code>\n<code>componentWillUnmount()</code>\nThe next several lessons will cover some of the basic use cases for these lifecycle methods.\n  \n##### Note: The ``` componentWillMount ``` Lifecycle method will be deprecated in a future version of 16.X and removed in version 17. [(Source)](https://reactjs.org/blog/2018/03/27/update-on-async-rendering.html)\n"},
"5a24c314108439a4d4036168" : {"id":"5a24c314108439a4d4036168","title":"Write a React Component from Scratch","videoUrl":"","content":"\nNow that you've learned the basics of JSX and React components, it's time to write a component on your own. React components are the core building blocks of React applications so it's important to become very familiar with writing them. Remember, a typical React component is an ES6 <code>class</code> which extends <code>React.Component</code>. It has a render method that returns HTML (from JSX) or <code>null</code>. This is the basic form of a React component. Once you understand this well, you will be prepared to start building more complex React projects.\n"},
"5a24c314108439a4d4036177" : {"id":"5a24c314108439a4d4036177","title":"Write a Simple Counter","videoUrl":"","content":"\nYou can design a more complex stateful component by combining the concepts covered so far. These include initializing <code>state</code>, writing methods that set <code>state</code>, and assigning click handlers to trigger these methods.\n"},
"5a24c314108439a4d4036154" : {"id":"5a24c314108439a4d4036154","title":"Combine Multiple Reducers","videoUrl":"","content":"\nWhen the state of your app begins to grow more complex, it may be tempting to divide state into multiple pieces. Instead, remember the first principle of Redux: all app state is held in a single state object in the store. Therefore, Redux provides reducer composition as a solution for a complex state model. You define multiple reducers to handle different pieces of your application's state, then compose these reducers together into one root reducer. The root reducer is then passed into the Redux <code>createStore()</code> method.\nIn order to let us combine multiple reducers together, Redux provides the <code>combineReducers()</code> method. This method accepts an object as an argument in which you define properties which associate keys to specific reducer functions. The name you give to the keys will be used by Redux as the name for the associated piece of state.\nTypically, it is a good practice to create a reducer for each piece of application state when they are distinct or unique in some way. For example, in a note-taking app with user authentication, one reducer could handle authentication while another handles the text and notes that the user is submitting. For such an application, we might write the <code>combineReducers()</code> method like this:\n<blockquote>const rootReducer = Redux.combineReducers({<br>&nbsp;&nbsp;auth: authenticationReducer,<br>&nbsp;&nbsp;notes: notesReducer<br>});</blockquote>\nNow, the key <code>notes</code> will contain all of the state associated with our notes and handled by our <code>notesReducer</code>. This is how multiple reducers can be composed to manage more complex application state. In this example, the state held in the Redux store would then be a single object containing <code>auth</code> and <code>notes</code> properties.\n"},
"5a24c314108439a4d403615b" : {"id":"5a24c314108439a4d403615b","title":"Copy an Object with Object.assign","videoUrl":"","content":"\nThe last several challenges worked with arrays, but there are ways to help enforce state immutability when state is an <code>object</code>, too. A useful tool for handling objects is the <code>Object.assign()</code> utility. <code>Object.assign()</code> takes a target object and source objects and maps properties from the source objects to the target object. Any matching properties are overwritten by properties in the source objects. This behavior is commonly used to make shallow copies of objects by passing an empty object as the first argument followed by the object(s) you want to copy. Here's an example:\n<code>const newObject = Object.assign({}, obj1, obj2);</code>\nThis creates <code>newObject</code> as a new <code>object</code>, which contains the properties that currently exist in <code>obj1</code> and <code>obj2</code>.\n"},
"5a24c314108439a4d403614b" : {"id":"5a24c314108439a4d403614b","title":"Create a Redux Store","videoUrl":"","content":"\nRedux is a state management framework that can be used with a number of different web technologies, including React.\nIn Redux, there is a single state object that's responsible for the entire state of your application. This means if you had a React app with ten components, and each component had its own local state, the entire state of your app would be defined by a single state object housed in the Redux <code>store</code>. This is the first important principle to understand when learning Redux: the Redux store is the single source of truth when it comes to application state.\nThis also means that any time any piece of your app wants to update state, it <strong>must</strong> do so through the Redux store. The unidirectional data flow makes it easier to track state management in your app.\n"},
"5a24c314108439a4d403614e" : {"id":"5a24c314108439a4d403614e","title":"Define an Action Creator","videoUrl":"","content":"\nAfter creating an action, the next step is sending the action to the Redux store so it can update its state. In Redux, you define action creators to accomplish this. An action creator is simply a JavaScript function that returns an action. In other words, action creators create objects that represent action events.\n"},
"5a24c314108439a4d403614d" : {"id":"5a24c314108439a4d403614d","title":"Define a Redux Action","videoUrl":"","content":"\nSince Redux is a state management framework, updating state is one of its core tasks. In Redux, all state updates are triggered by dispatching actions. An action is simply a JavaScript object that contains information about an action event that has occurred. The Redux store receives these action objects, then updates its state accordingly. Sometimes a Redux action also carries some data. For example, the action carries a username after a user logs in. While the data is optional, actions must carry a <code>type</code> property that specifies the 'type' of action that occurred.\nThink of Redux actions as messengers that deliver information about events happening in your app to the Redux store. The store then conducts the business of updating state based on the action that occurred.\n"},
"5a24c314108439a4d403614f" : {"id":"5a24c314108439a4d403614f","title":"Dispatch an Action Event","videoUrl":"","content":"\n<code>dispatch</code> method is what you use to dispatch actions to the Redux store. Calling <code>store.dispatch()</code> and passing the value returned from an action creator sends an action back to the store.\nRecall that action creators return an object with a type property that specifies the action that has occurred. Then the method dispatches an action object to the Redux store. Based on the previous challenge's example, the following lines are equivalent, and both dispatch the action of type <code>LOGIN</code>:\n<blockquote>store.dispatch(actionCreator());<br>store.dispatch({ type: 'LOGIN' });</blockquote>\n"},
"5a24c314108439a4d403614c" : {"id":"5a24c314108439a4d403614c","title":"Get State from the Redux Store","videoUrl":"","content":"\nThe Redux store object provides several methods that allow you to interact with it. For example, you can retrieve the current <code>state</code> held in the Redux store object with the <code>getState()</code> method.\n"},
"5a24c314108439a4d4036150" : {"id":"5a24c314108439a4d4036150","title":"Handle an Action in the Store","videoUrl":"","content":"\nAfter an action is created and dispatched, the Redux store needs to know how to respond to that action. This is the job of a <code>reducer</code> function. Reducers in Redux are responsible for the state modifications that take place in response to actions. A <code>reducer</code> takes <code>state</code> and <code>action</code> as arguments, and it always returns a new <code>state</code>. It is important to see that this is the <strong>only</strong> role of the reducer. It has no side effects &mdash; it never calls an API endpoint and it never has any hidden surprises. The reducer is simply a pure function that takes state and action, then returns new state.\nAnother key principle in Redux is that <code>state</code> is read-only. In other words, the <code>reducer</code> function must <strong>always</strong> return a new copy of <code>state</code> and never modify state directly. Redux does not enforce state immutability, however, you are responsible for enforcing it in the code of your reducer functions. You'll practice this in later challenges.\n"},
"5a24c314108439a4d4036158" : {"id":"5a24c314108439a4d4036158","title":"Never Mutate State","videoUrl":"","content":"\nThese final challenges describe several methods of enforcing the key principle of state immutability in Redux. Immutable state means that you never modify state directly, instead, you return a new copy of state.\nIf you took a snapshot of the state of a Redux app over time, you would see something like <code>state 1</code>, <code>state 2</code>, <code>state 3</code>,<code>state 4</code>, <code>...</code> and so on where each state may be similar to the last, but each is a distinct piece of data. This immutability, in fact, is what provides such features as time-travel debugging that you may have heard about.\nRedux does not actively enforce state immutability in its store or reducers, that responsibility falls on the programmer. Fortunately, JavaScript (especially ES6) provides several useful tools you can use to enforce the immutability of your state, whether it is a <code>string</code>, <code>number</code>, <code>array</code>, or <code>object</code>. Note that strings and numbers are primitive values and are immutable by nature. In other words, 3 is always 3. You cannot change the value of the number 3. An <code>array</code> or <code>object</code>, however, is mutable. In practice, your state will probably consist of an <code>array</code> or <code>object</code>, as these are useful data structures for representing many types of information.\n"},
"5a24c314108439a4d4036153" : {"id":"5a24c314108439a4d4036153","title":"Register a Store Listener","videoUrl":"","content":"\nAnother method you have access to on the Redux <code>store</code> object is <code>store.subscribe()</code>. This allows you to subscribe listener functions to the store, which are called whenever an action is dispatched against the store. One simple use for this method is to subscribe a function to your store that simply logs a message every time an action is received and the store is updated.\n"},
"5a24c314108439a4d403615a" : {"id":"5a24c314108439a4d403615a","title":"Remove an Item from an Array","videoUrl":"","content":"\nTime to practice removing items from an array. The spread operator can be used here as well. Other useful JavaScript methods include <code>slice()</code> and <code>concat()</code>.\n"},
"5a24c314108439a4d4036155" : {"id":"5a24c314108439a4d4036155","title":"Send Action Data to the Store","videoUrl":"","content":"\nBy now you've learned how to dispatch actions to the Redux store, but so far these actions have not contained any information other than a <code>type</code>. You can also send specific data along with your actions. In fact, this is very common because actions usually originate from some user interaction and tend to carry some data with them. The Redux store often needs to know about this data.\n"},
"5a24c314108439a4d4036151" : {"id":"5a24c314108439a4d4036151","title":"Use a Switch Statement to Handle Multiple Actions","videoUrl":"","content":"\nYou can tell the Redux store how to handle multiple action types. Say you are managing user authentication in your Redux store. You want to have a state representation for when users are logged in and when they are logged out. You represent this with a single state object with the property <code>authenticated</code>. You also need action creators that create actions corresponding to user login and user logout, along with the action objects themselves.\n"},
"5a24c314108439a4d4036152" : {"id":"5a24c314108439a4d4036152","title":"Use const for Action Types","videoUrl":"","content":"\nA common practice when working with Redux is to assign action types as read-only constants, then reference these constants wherever they are used. You can refactor the code you're working with to write the action types as <code>const</code> declarations.\n"},
"5a24c314108439a4d4036156" : {"id":"5a24c314108439a4d4036156","title":"Use Middleware to Handle Asynchronous Actions","videoUrl":"","content":"\nSo far these challenges have avoided discussing asynchronous actions, but they are an unavoidable part of web development. At some point you'll need to call asynchronous endpoints in your Redux app, so how do you handle these types of requests? Redux provides middleware designed specifically for this purpose, called Redux Thunk middleware. Here's a brief description how to use this with Redux.\nTo include Redux Thunk middleware, you pass it as an argument to <code>Redux.applyMiddleware()</code>. This statement is then provided as a second optional parameter to the <code>createStore()</code> function. Take a look at the code at the bottom of the editor to see this. Then, to create an asynchronous action, you return a function in the action creator that takes <code>dispatch</code> as an argument. Within this function, you can dispatch actions and perform asynchronous requests.\nIn this example, an asynchronous request is simulated with a <code>setTimeout()</code> call. It's common to dispatch an action before initiating any asynchronous behavior so that your application state knows that some data is being requested (this state could display a loading icon, for instance). Then, once you receive the data, you dispatch another action which carries the data as a payload along with information that the action is completed.\nRemember that you're passing <code>dispatch</code> as a parameter to this special action creator. This is what you'll use to dispatch your actions, you simply pass the action directly to dispatch and the middleware takes care of the rest.\n"},
"5a24c314108439a4d4036159" : {"id":"5a24c314108439a4d4036159","title":"Use the Spread Operator on Arrays","videoUrl":"","content":"\nOne solution from ES6 to help enforce state immutability in Redux is the spread operator: <code>...</code>. The spread operator has a variety of applications, one of which is well-suited to the previous challenge of producing a new array from an existing array. This is relatively new, but commonly used syntax. For example, if you have an array <code>myArray</code> and write:\n<code>let newArray = [...myArray];</code>\n<code>newArray</code> is now a clone of <code>myArray</code>. Both arrays still exist separately in memory. If you perform a mutation like <code>newArray.push(5)</code>, <code>myArray</code> doesn't change. The <code>...</code> effectively <i>spreads</i> out the values in <code>myArray</code> into a new array. To clone an array but add additional values in the new array, you could write <code>[...myArray, 'new value']</code>. This would return a new array composed of the values in <code>myArray</code> and the string <code>'new value'</code> as the last value. The spread syntax can be used multiple times in array composition like this, but it's important to note that it only makes a shallow copy of the array. That is to say, it only provides immutable array operations for one-dimensional arrays.\n"},
"5a24c314108439a4d4036157" : {"id":"5a24c314108439a4d4036157","title":"Write a Counter with Redux","videoUrl":"","content":"\nNow you've learned all the core principles of Redux! You've seen how to create actions and action creators, create a Redux store, dispatch your actions against the store, and design state updates with pure reducers. You've even seen how to manage complex state with reducer composition and handle asynchronous actions. These examples are simplistic, but these concepts are the core principles of Redux. If you understand them well, you're ready to start building your own Redux app. The next challenges cover some of the details regarding <code>state</code> immutability, but first, here's a review of everything you've learned so far.\n"},
"587d7dbf367417b2b2512bbb" : {"id":"587d7dbf367417b2b2512bbb","title":"Apply a Style Until a Condition is Met with @while","videoUrl":"","content":"\nThe <code>@while</code> directive is an option with similar functionality to the JavaScript <code>while</code> loop. It creates CSS rules until a condition is met.\nThe <code>@for</code> challenge gave an example to create a simple grid system. This can also work with <code>@while</code>.\n<blockquote>$x: 1;<br>@while $x < 13 {<br>&nbsp;&nbsp;.col-#{$x} { width: 100%/12 * $x;}<br>&nbsp;&nbsp;$x: $x + 1;<br>}</blockquote>\nFirst, define a variable <code>$x</code> and set it to 1. Next, use the <code>@while</code> directive to create the grid system <i>while</i> <code>$x</code> is less than 13.\nAfter setting the CSS rule for <code>width</code>, <code>$x</code> is incremented by 1 to avoid an infinite loop.\n"},
"587d7dbd367417b2b2512bb6" : {"id":"587d7dbd367417b2b2512bb6","title":"Create Reusable CSS with Mixins","videoUrl":"","content":"\nIn Sass, a <code>mixin</code> is a group of CSS declarations that can be reused throughout the style sheet.\nNewer CSS features take time before they are fully adopted and ready to use in all browsers. As features are added to browsers, CSS rules using them may need vendor prefixes. Consider \"box-shadow\":\n<blockquote>div {<br>&nbsp;&nbsp;-webkit-box-shadow: 0px 0px 4px #fff;<br>&nbsp;&nbsp;-moz-box-shadow: 0px 0px 4px #fff;<br>&nbsp;&nbsp;-ms-box-shadow: 0px 0px 4px #fff;<br>&nbsp;&nbsp;box-shadow: 0px 0px 4px #fff;<br>}</blockquote>\nIt's a lot of typing to re-write this rule for all the elements that have a <code>box-shadow</code>, or to change each value to test different effects.\n<code>Mixins</code> are like functions for CSS. Here is how to write one:\n<blockquote>@mixin box-shadow($x, $y, $blur, $c){ <br>&nbsp;&nbsp;-webkit-box-shadow: $x, $y, $blur, $c;<br>&nbsp;&nbsp;-moz-box-shadow: $x, $y, $blur, $c;<br>&nbsp;&nbsp;-ms-box-shadow: $x, $y, $blur, $c;<br>&nbsp;&nbsp;box-shadow: $x, $y, $blur, $c;<br>}</blockquote>\nThe definition starts with <code>@mixin</code> followed by a custom name. The parameters (the <code>$x</code>, <code>$y</code>, <code>$blur</code>, and <code>$c</code> in the example above) are optional.\nNow any time a <code>box-shadow</code> rule is needed, only a single line calling the <code>mixin</code> replaces having to type all the vendor prefixes. A <code>mixin</code> is called with the <code>@include</code> directive:\n<blockquote>div {<br>&nbsp;&nbsp;@include box-shadow(0px, 0px, 4px, #fff);<br>}</blockquote>\n"},
"587d7fa5367417b2b2512bbd" : {"id":"587d7fa5367417b2b2512bbd","title":"Extend One Set of CSS Styles to Another Element","videoUrl":"","content":"\nSass has a feature called <code>extend</code> that makes it easy to borrow the CSS rules from one element and build upon them in another.\nFor example, the below block of CSS rules style a <code>.panel</code> class. It has a <code>background-color</code>, <code>height</code> and <code>border</code>.\n<blockquote>.panel{<br>&nbsp;&nbsp;background-color: red;<br>&nbsp;&nbsp;height: 70px;<br>&nbsp;&nbsp;border: 2px solid green;<br>}</blockquote>\nNow you want another panel called <code>.big-panel</code>. It has the same base properties as <code>.panel</code>, but also needs a <code>width</code> and <code>font-size</code>.\nIt's possible to copy and paste the initial CSS rules from <code>.panel</code>, but the code becomes repetitive as you add more types of panels.\nThe <code>extend</code> directive is a simple way to reuse the rules written for one element, then add more for another:\n<blockquote>.big-panel{<br>&nbsp;&nbsp;@extend .panel;<br>&nbsp;&nbsp;width: 150px;<br>&nbsp;&nbsp;font-size: 2em;<br>}</blockquote>\nThe <code>.big-panel</code> will have the same properties as <code>.panel</code> in addition to the new styles.\n"},
"587d7dbd367417b2b2512bb5" : {"id":"587d7dbd367417b2b2512bb5","title":"Nest CSS with Sass","videoUrl":"","content":"\nSass allows <code>nesting</code> of CSS rules, which is a useful way of organizing a style sheet.\nNormally, each element is targeted on a different line to style it, like so:\n<blockquote>nav {<br>&nbsp;&nbsp;background-color: red;<br>}<br><br>nav ul {<br>&nbsp;&nbsp;list-style: none;<br>}<br><br>nav ul li {<br>&nbsp;&nbsp;display: inline-block;<br>}</blockquote>\nFor a large project, the CSS file will have many lines and rules. This is where <code>nesting</code> can help organize your code by placing child style rules within the respective parent elements:\n<blockquote>nav {<br>&nbsp;&nbsp;background-color: red;<br><br>&nbsp;&nbsp;ul {<br>&nbsp;&nbsp;&nbsp;&nbsp;list-style: none;<br><br>&nbsp;&nbsp;&nbsp;&nbsp;li {<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;display: inline-block;<br>&nbsp;&nbsp;&nbsp;&nbsp;}<br>&nbsp;&nbsp;}<br>}<br></blockquote>\n"},
"587d7dbf367417b2b2512bbc" : {"id":"587d7dbf367417b2b2512bbc","title":"Split Your Styles into Smaller Chunks with Partials","videoUrl":"","content":"\n<code>Partials</code> in Sass are separate files that hold segments of CSS code. These are imported and used in other Sass files. This is a great way to group similar code into a module to keep it organized.\nNames for <code>partials</code> start with the underscore (<code>_</code>) character, which tells Sass it is a small segment of CSS and not to convert it into a CSS file. Also, Sass files end with the <code>.scss</code> file extension. To bring the code in the <code>partial</code> into another Sass file, use the <code>@import</code> directive.\nFor example, if all your <code>mixins</code> are saved in a <code>partial</code> named \"_mixins.scss\", and they are needed in the \"main.scss\" file, this is how to use them in the main file:\n<blockquote>// In the main.scss file<br><br>@import 'mixins'</blockquote>\nNote that the underscore is not needed in the <code>import</code> statement - Sass understands it is a <code>partial</code>. Once a <code>partial</code> is imported into a file, all variables, <code>mixins</code>, and other code are available to use.\n"},
"587d7dbd367417b2b2512bb4" : {"id":"587d7dbd367417b2b2512bb4","title":"Store Data with Sass Variables","videoUrl":"","content":"\nOne feature of Sass that's different than CSS is it uses variables. They are declared and set to store data, similar to JavaScript.\nIn JavaScript, variables are defined using the <code>let</code> and <code>const</code> keywords. In Sass, variables start with a <code>$</code> followed by the variable name.\nHere are a couple examples:\n<blockquote>$main-fonts: Arial, sans-serif;<br>$headings-color: green;<br><br>//To use variables:<br>h1 {<br>&nbsp;&nbsp;font-family: $main-fonts;<br>&nbsp;&nbsp;color: $headings-color;<br>}</blockquote>\nOne example where variables are useful is when a number of elements need to be the same color. If that color is changed, the only place to edit the code is the variable value.\n"},
"587d7dbf367417b2b2512bba" : {"id":"587d7dbf367417b2b2512bba","title":"Use @each to Map Over Items in a List","videoUrl":"","content":"\nThe last challenge showed how the <code>@for</code> directive uses a starting and ending value to loop a certain number of times. Sass also offers the <code>@each</code> directive which loops over each item in a list or map.\nOn each iteration, the variable gets assigned to the current value from the list or map.\n<blockquote>@each $color in blue, red, green {<br>&nbsp;&nbsp;.#{$color}-text {color: $color;}<br>}</blockquote>\nA map has slightly different syntax. Here's an example:\n<blockquote>$colors: (color1: blue, color2: red, color3: green);<br><br>@each $key, $color in $colors {<br>&nbsp;&nbsp;.#{$color}-text {color: $color;}<br>}</blockquote>\nNote that the <code>$key</code> variable is needed to reference the keys in the map. Otherwise, the compiled CSS would have <code>color1</code>, <code>color2</code>... in it.\nBoth of the above code examples are converted into the following CSS:\n<blockquote>.blue-text {<br>&nbsp;&nbsp;color: blue;<br>}<br><br>.red-text {<br>&nbsp;&nbsp;color: red;<br>}<br><br>.green-text {<br>&nbsp;&nbsp;color: green;<br>}</blockquote>\n"},
"587d7dbe367417b2b2512bb9" : {"id":"587d7dbe367417b2b2512bb9","title":"Use @for to Create a Sass Loop","videoUrl":"","content":"\nThe <code>@for</code> directive adds styles in a loop, very similar to a <code>for</code> loop in JavaScript.\n<code>@for</code> is used in two ways: \"start through end\" or \"start to end\". The main difference is that the \"start <b>to</b> end\" <em>excludes</em> the end number as part of the count, and \"start <b>through</b> end\" <em>includes</em> the end number as part of the count.\nHere's a start <b>through</b> end example:\n<blockquote>@for $i from 1 through 12 {<br>&nbsp;&nbsp;.col-#{$i} { width: 100%/12 * $i; }<br>}</blockquote>\nThe <code>#{$i}</code> part is the syntax to combine a variable (<code>i</code>) with text to make a string. When the Sass file is converted to CSS, it looks like this:\n<blockquote>.col-1 {<br>&nbsp;&nbsp;width: 8.33333%;<br>}<br><br>.col-2 {<br>&nbsp;&nbsp;width: 16.66667%;<br>}<br><br>...<br><br>.col-12 {<br>&nbsp;&nbsp;width: 100%;<br>}</blockquote>\nThis is a powerful way to create a grid layout. Now you have twelve options for column widths available as CSS classes.\n"},
"587d7dbe367417b2b2512bb8" : {"id":"587d7dbe367417b2b2512bb8","title":"Use @if and @else to Add Logic To Your Styles","videoUrl":"","content":"\nThe <code>@if</code> directive in Sass is useful to test for a specific case - it works just like the <code>if</code> statement in JavaScript</code>.\n<blockquote>@mixin make-bold($bool) {<br>&nbsp;&nbsp;@if $bool == true {<br>&nbsp;&nbsp;&nbsp;&nbsp;font-weight: bold;<br>&nbsp;&nbsp;}<br>}</blockquote>\nAnd just like in JavaScript, <code>@else if</code> and <code>@else</code> test for more conditions:\n<blockquote>@mixin text-effect($val) {<br>&nbsp;&nbsp;@if $val == danger {<br>&nbsp;&nbsp;&nbsp;&nbsp;color: red;<br>&nbsp;&nbsp;}<br>&nbsp;&nbsp;@else if $val == alert {<br>&nbsp;&nbsp;&nbsp;&nbsp;color: yellow;<br>&nbsp;&nbsp;}<br>&nbsp;&nbsp;@else if $val == success {<br>&nbsp;&nbsp;&nbsp;&nbsp;color: green;<br>&nbsp;&nbsp;}<br>&nbsp;&nbsp;@else {<br>&nbsp;&nbsp;&nbsp;&nbsp;color: black;<br>&nbsp;&nbsp;}<br>}</blockquote>\n"}}
}